{"Q": "What kind of wall mount is needed for the Vibe S1 55 Inch Interactive Whiteboard?", "A": "You would need to purchase a third-party TV wall mount that supports VESA 200X200 and is capable of supporting at least 65 pounds. The supported screw model is M6, and the length depends on the mount but should be between 12-20mm.", "metadata": {"created_at": "2023-03-31 20:08:45"}}
{"Q": "What cables are needed to setup the Vibe S1 55 Inch Interactive Whiteboard for touch functionality?", "A": "For touch functionality, you would need a USB-C video monitor cable or an A-Male to B-Male printer cable, along with an HDMI cable.", "metadata": {"created_at": "2023-03-31 20:08:45"}}
{"Q": "Is the stylus included with the Vibe S1 55 Inch Interactive Whiteboard?", "A": "Yes, one stylus is included with the board.", "metadata": {"created_at": "2023-03-31 20:08:45"}}
{"Q": "How much does an additional active stylus for the Vibe S1 55 Inch Interactive Whiteboard cost?", "A": "An additional active stylus costs $40 USD.", "metadata": {"created_at": "2023-03-31 20:08:45"}}
{"Q": "Does Vibe ship to PO Box addresses?", "A": "No, Vibe does not ship to PO Box addresses.", "metadata": {"created_at": "2023-03-31 20:08:45"}}
{"Q": "Is Vibe compatible with Microsoft products?", "A": "Yes, Vibe boards are compatible with Microsoft products.", "metadata": {"created_at": "2023-04-03 16:33:10"}}
{"Q": "Does the Chromium OS run on the Vibe S1 55 Inch Interactive Whiteboard?", "A": "Yes, the Chromium OS runs on both the Vibe S1 55\" and Vibe S1 75\" Interactive Whiteboard.", "metadata": {"created_at": "2023-04-03 16:33:10"}}
{"Q": "Can I see demos or articles on how Vibe is used in a preschool setting?", "A": "Yes, there is a 20 minute demo, \"Teaching with Vibe,\" that showcases features and applications used by educators, and there are case studies available from teachers like Hannah Brown and Robyn Cooper.", "metadata": {"created_at": "2023-04-03 16:33:10"}}
{"Q": "Is there a difference between a Vibe Canvas and a virtual demo?", "A": "Yes, a Vibe Canvas is the use of free whiteboarding software, while a virtual demo includes a live presentation via Zoom showing how the Vibe board works and an expert explaining its utility for specific use cases.", "metadata": {"created_at": "2023-04-03 16:33:10"}}
{"Q": "Can I get a cost estimate for multiple Vibe S1 55 Inch Interactive Whiteboards?", "A": "Certainly, we can provide a cost estimate when you provide us with your billing/shipping address, contact name and number, and the required quantity.", "metadata": {"created_at": "2023-04-03 16:40:13"}}
{"Q": "Is there a discount for purchasing multiple Vibe S1 55 Inch Interactive Whiteboards?", "A": "Discounts for bulk purchases are possible, and we can discuss this once you provide the necessary details for a quote.", "metadata": {"created_at": "2023-04-03 16:40:13"}}
{"Q": "Is free shipping available when purchasing Vibe products?", "A": "Yes, we can apply free shipping to your order if you have received an email from us stating that you are eligible for free shipping.", "metadata": {"created_at": "2023-04-03 16:40:13"}}
{"Q": "Can I purchase a replacement power supply for the Vibe S1 55 Inch Interactive Whiteboard?", "A": "You can purchase a compatible power cord on Amazon for $9.99. However, Vibe does not sell internal parts like the power supply board. If you're experiencing power issues, contacting Vibe support is recommended as the board might need to be replaced.", "metadata": {"created_at": "2023-04-04 18:53:52"}}
{"Q": "How can I contact Vibe support if I have an issue with my Vibe S1 board?", "A": "The Vibe support team can be reached at support@vibe.us or through creating a support ticket on the Vibe Knowledge Base.", "metadata": {"created_at": "2023-04-04 18:53:52"}}
{"Q": "What \"complimentary wall mount accessories\" are included with the Vibe S1 75 Inch Interactive Whiteboard?", "A": "The standard wall mount is included with the purchase of the Vibe S1 75 Inch Interactive Whiteboard, so there is no need to buy an additional one.", "metadata": {"created_at": "2023-04-04 19:47:41"}}
{"Q": "Do the wall mounts for Vibe S1 75 Inch Interactive Whiteboard articulate, turn, or extend?", "A": "No, the wall mount for the Vibe S1 75 Inch Interactive Whiteboard doesn't articulate.", "metadata": {"created_at": "2023-04-04 19:47:41"}}
{"Q": "What is the VESA size of the wall mount for the Vibe S1 75 Inch Interactive Whiteboard?", "A": "The wall mount for the Vibe S1 75 Inch Interactive Whiteboard has a VESA of 800 x 400 mm.", "metadata": {"created_at": "2023-04-04 19:47:41"}}
{"Q": "What is the weight capacity and dimensions of the wall mount for the Vibe S1 75 Inch Interactive Whiteboard?", "A": "The wall mount for the Vibe S1 75 Inch Interactive Whiteboard can support up to 108 lbs, with a depth of 52.3mm (2.1 inches) when combining the A-Plate (21.7mm) with B-Bars (30.6mm).", "metadata": {"created_at": "2023-04-04 19:47:41"}}
{"Q": "What are the dimensions of the 55 inch board in the package delivered?", "A": "The dimensions are provided in the link to the Vibe Smart Whiteboard S1 55\" Tech Specs on our website.", "metadata": {"created_at": "2023-04-07 14:12:10"}}
{"Q": "Where can I find the pairing code for the VibeOne app?", "A": "The pairing code appears on the bottom right side of the Vibe board after you select \"pairing is required\" on the app on your phone. Then you will receive a pop-up on the board asking to allow or dismiss the request. Upon selecting \"Allow,\" the code will be displayed on the board and you need to enter it into your phone. If the pop-up disappears, you just need to select pairing on your phone again for it to reappear.", "metadata": {"created_at": "2023-04-10 19:44:12"}}
{"Q": "Can the Vibe board be mounted vertically?", "A": "No, the Vibe board is designed to be used in landscape mode and is not meant to be mounted vertically. Even though portrait apps will work with the board in landscape mode, they will have black boundaries on the sides.", "metadata": {"created_at": "2023-04-10 19:44:12"}}
{"Q": "Where can I find recommendations for wall mounts compatible with the Vibe Board S1 55\"?", "A": "Recommendations for wall mounts that are compatible with the Vibe Board S1 55\" can be found in this article: https://vibe.how/en/articles/7007320-wall-mounts-for-vibe-board-s1-55. Most TV wall mounts that support VESA 200X200 and can support at least 65 pounds will work. The supported screw model is M6, and the length should be between 12-20mm.", "metadata": {"created_at": "2023-04-10 19:44:12"}}
{"Q": "How can a business buy direct from Vibe by using a PO?", "A": "A business can buy direct from Vibe by first getting a quote from us to create a PO, and we offer net 30 terms.", "metadata": {"created_at": "2023-04-11 15:42:41"}}
{"Q": "Are there any dealer discounts available when purchasing from Vibe?", "A": "Yes, we have reseller pricing and discounts that you can avail of once you sign up for the Vibe Reseller Program.", "metadata": {"created_at": "2023-04-11 15:42:41"}}
{"Q": "How does a business become a distributor or get dealer discounts?", "A": "To become a distributor or get dealer discounts, visit the Vibe Reseller Program page to fill in the Vibe reseller Partner form and provide your resale certificate, W-9, and tax forms via the specified email to be considered for an official reseller quote.", "metadata": {"created_at": "2023-04-11 15:42:41"}}
{"Q": "How can I use the other end of my Vibe S1 board's stylus as an eraser?", "A": "You cannot use the rubber part on the other end of the stylus as an eraser. To switch between the pen and eraser in the Canvas app, you should press the eraser switch button, which is the first button above the pen tip.", "metadata": {"created_at": "2023-04-11 16:39:22"}}
{"Q": "Are there other functions for the buttons on the Vibe S1 stylus?", "A": "Yes, besides the eraser switch button, the other two buttons on the Vibe S1 stylus are for page up and page down functions.", "metadata": {"created_at": "2023-04-11 16:39:22"}}
{"Q": "How can I wake the Vibe interactive whiteboard from sleep mode?", "A": "Press the lit power button located at the back of the device. If the issue persists, please reach out to support for further assistance.", "metadata": {"created_at": "2023-04-12 17:14:52"}}
{"Q": "Do you sell wall mounts for the Vibe S1 55\" interactive whiteboard?", "A": "No, we do not sell wall mounts. Most TV wall mounts that support VESA 200X200 and can support at least 65 pounds with M6 screw model (12-20mm length) will be compatible with the Vibe S1 55\" interactive whiteboard.", "metadata": {"created_at": "2023-04-12 21:43:57"}}
{"Q": "How do I get the volume to work on a Vibe board using an Amazon Fire Stick remote with HDMI input?", "A": "Our technical support team will reach out to provide assistance with this issue after creating a ticket.", "metadata": {"created_at": "2023-04-14 19:32:30"}}
{"Q": "How can a non-profit agency submit tax exempt info with an order?", "A": "Non-profit agencies can submit tax exempt information by sending the billing/shipping address, contact name, contact number, item name and quantity, and a copy of the sales tax-exempt form to the Vibe sales team.", "metadata": {"created_at": "2023-04-17 15:44:37"}}
{"Q": "What information is required to process a tax-exempt purchase for a Vibe Board?", "A": "To process a tax-exempt Vibe Board purchase, the required information includes billing/shipping address, contact name, contact number, item name, quantity, and a copy of the sales tax-exempt form.", "metadata": {"created_at": "2023-04-17 15:44:37"}}
{"Q": "How can I try the Vibe interactive whiteboard?", "A": "You can schedule a demo through the link provided by our sales team, and also watch our 4 min product tour or videos on our YouTube channel to see the rich features of our Board S1 55\".", "metadata": {"created_at": "2023-04-17 17:27:12"}}
{"Q": "Do you have an in-house financing option for purchases?", "A": "We do not have an in-house financing option but you can use Affirm, a 3rd party service, for monthly payments or we accept purchase orders with net 30 terms.", "metadata": {"created_at": "2023-04-17 17:27:12"}}
{"Q": "What kind of training is available for Vibe products?", "A": "We offer free complimentary training or onboarding sessions to our customers via Zoom, as well as various support resources for getting started with Vibe.", "metadata": {"created_at": "2023-04-17 17:27:12"}}
{"Q": "How can I require a PIN to log in to my Vibe board?", "A": "The support team can assist you with setting up a PIN for login. Contact them at support@vibe.us or submit a support ticket on the Vibe Knowledge Base.", "metadata": {"created_at": "2023-04-17 18:24:52"}}
{"Q": "How do I set up multiple accounts on my Vibe board?", "A": "Please reach out to our support team for assistance with setting up multiple accounts on your Vibe board.", "metadata": {"created_at": "2023-04-17 18:24:52"}}
{"Q": "Is there a direct phone support line I can call for Vibe?", "A": "Vibe does not have a direct number for phone support, but you can request a support call via Zoom or request a call by phone and a member of our support team will reach out if available.", "metadata": {"created_at": "2023-04-17 18:24:52"}}
{"Q": "Does the quote for the Vibe S1 55 inch with stand and camera include sales tax?", "A": "The quote can exclude sales tax if the customer provides a tax exemption form.", "metadata": {"created_at": "2023-04-17 20:08:08"}}
{"Q": "Is the shipping address for Southern Crescent Technical College in Griffin, GA still valid for the quote?", "A": "Yes, the shipping address provided is still valid.", "metadata": {"created_at": "2023-04-17 20:08:08"}}
{"Q": "Does the quote include shipping?", "A": "The quote includes free curbside delivery, with additional services available at an extra charge.", "metadata": {"created_at": "2023-04-17 20:08:08"}}
{"Q": "Is standard shipping via UPS or FedEx ground free?", "A": "Yes, there is no shipping cost for standard ground shipping; this would be the curbside delivery option.", "metadata": {"created_at": "2023-04-17 20:08:08"}}
{"Q": "Can government entities purchase Vibe products without taxes?", "A": "Yes, government entities with tax exempt status can purchase without taxes by providing a custom purchase link from Vibe, along with necessary documentation such as a sales tax-exempt form.", "metadata": {"created_at": "2023-04-18 19:24:59"}}
{"Q": "How long does it take for a Vibe product to ship once it is ordered?", "A": "It takes 1-2 days to process an order and approximately 5-7 business days for shipping within the US.", "metadata": {"created_at": "2023-04-18 19:24:59"}}
{"Q": "Does Vibe have resellers?", "A": "Yes, Vibe has resellers and if you prefer to purchase through one, you can inform them to contact Vibe for a quote.", "metadata": {"created_at": "2023-04-18 19:24:59"}}
{"Q": "What is the current shipping time for Vibe products within the US?", "A": "Shipping time within the US is approximately 5-7 business days, after a 1-2 day order processing period.", "metadata": {"created_at": "2023-04-18 21:45:03"}}
{"Q": "Do your Vibe boards support third-party apps?", "A": "Yes, the Vibe S1 and 75\" Vibe Boards support many third-party apps, as they are based on Chromium OS. Records can enable Google Play Store to download apps or use the Chrome Web Store.", "metadata": {"created_at": "2023-04-18 21:45:03"}}
{"Q": "Is the Vibe board battery powered or does it need to be plugged in?", "A": "The Vibe board must be plugged into a power outlet as there is no battery option available currently.", "metadata": {"created_at": "2023-04-18 21:45:03"}}
{"Q": "Are there any discounts or promotions for teachers or schools?", "A": "There is no special educator's discount, but there is a WELCOME100 offer for new visitors to the Vibe website, providing a $100 discount after signing up with an email address. Sales tax exemption is also available for those with a valid certificate.", "metadata": {"created_at": "2023-04-18 21:45:03"}}
{"Q": "Can you use Vibe boards as a screenshare/monitor and then draw on it that way?", "A": "Yes, you can annotate during screencasting.", "metadata": {"created_at": "2023-04-19 16:10:31"}}
{"Q": "If I order a Vibe product, how long does delivery typically take?", "A": "It typically takes 1-2 days to process an order, and shipping time within the US is approximately 5-7 business days, depending on your location.", "metadata": {"created_at": "2023-04-19 16:10:31"}}
{"Q": "What is the Vibe SmartCam (C1)?", "A": "The Vibe SmartCam C1 is a camera that works with the S1 board only and is intended for video conferencing.", "metadata": {"created_at": "2023-04-19 16:10:31"}}
{"Q": "Can the Vibe board be set up as a third monitor to drag a PDF or Excel over to during a Zoom call and annotate on it?", "A": "If you want to display annotation during a Zoom call, you need to host the call directly from the Vibe board or join as a participant from the board so you can share the screen from the board.", "metadata": {"created_at": "2023-04-19 16:10:31"}}
{"Q": "How do you get information or files onto the Vibe board?", "A": "You can access files from Cloud storage drives like Google Drive, OneDrive, Box, or Dropbox through Vibe accounts or access native files such as Excel directly on the board.", "metadata": {"created_at": "2023-04-19 16:10:31"}}
{"Q": "How can I see a demo of the Vibe S1 board?", "A": "Vibe offers a 4 min product tour, instructional videos on their YouTube channel, and free demos that can be scheduled with a Vibe expert.", "metadata": {"created_at": "2023-04-19 16:10:31"}}
{"Q": "Can the Vibe S1 55 Inch Interactive Whiteboard screen share with a Windows 11 Dell Laptop?", "A": "Yes, the Vibe S1 55 Inch Interactive Whiteboard can screen share with a Windows 11 Dell Laptop using the VibeCast app, though the customer reported it being terribly slow and having limited functionality.", "metadata": {"created_at": "2023-04-19 16:43:18"}}
{"Q": "Is it possible to extend the PC display to the Vibe S1 55 Inch Interactive Whiteboard like with a Samsung TV?", "A": "There is no direct answer provided. The customer is advised to contact Vibe support for assistance with this question.", "metadata": {"created_at": "2023-04-19 16:43:18"}}
{"Q": "How can a customer reach out to the Vibe support team?", "A": "A customer can reach out to the Vibe support team by emailing support@vibe.us or submitting a support ticket through the Vibe Knowledge Base.", "metadata": {"created_at": "2023-04-19 16:43:18"}}
{"Q": "What is included within the box of the Vibe Board S1 55\"?", "A": "The Vibe Board S1 55\" comes with a stylus x1, power cord, and a quick start guide.", "metadata": {"created_at": "2023-04-19 17:44:38"}}
{"Q": "What does the Vibe Board Pro 75\" package contain?", "A": "The Vibe Board Pro 75\" package includes the Vibe Board Pro 75\", stylus x2, wall mount, remote control, HDMI cord & USB cable, power cord, and a quick start guide.", "metadata": {"created_at": "2023-04-19 17:44:38"}}
{"Q": "How much does the Vibe Board Pro 75\" cost?", "A": "The Vibe Board Pro 75\" is available at a cost of $6,999 USD.", "metadata": {"created_at": "2023-04-19 17:44:38"}}
{"Q": "Is there an additional cost for the stand for the Vibe Board Pro 75\"?", "A": "Yes, the stand for the Vibe Board Pro 75\" is available at an additional cost of $899 USD.", "metadata": {"created_at": "2023-04-19 17:44:38"}}
{"Q": "Can discounts be available for purchasing multiple Vibe boards?", "A": "Yes, discounts may be offered for purchasing multiple Vibe boards.", "metadata": {"created_at": "2023-04-19 17:44:38"}}
{"Q": "Does the 75\" board come with a complimentary wall mount?", "A": "Yes, the portable stand for the 75\" board comes with a complimentary wall mount included.", "metadata": {"created_at": "2023-04-19 17:44:38"}}
{"Q": "What is the recommended wall mount for the Vibe S1 55 Inch Interactive Whiteboard?", "A": "Most TV wall mounts that support VESA 200X200 and can support at least 65 pounds will work for our Vibe S1 Board 55\".", "metadata": {"created_at": "2023-04-19 18:26:08"}}
{"Q": "Is the Jason Mayfield $350 discount code still available?", "A": "The Jason Mayfield $350 discount code has changed, and it is now a $150 referral discount code.", "metadata": {"created_at": "2023-04-19 18:26:08"}}
{"Q": "Do you offer a military discount?", "A": "We do not offer a military discount.", "metadata": {"created_at": "2023-04-19 18:26:08"}}
{"Q": "Is there a welcome offer for new customers on the Vibe website?", "A": "Yes, as a new visitor you might receive a pop up for the WELCOME100 offer, which gives a $100 discount after signing up by entering your email address.", "metadata": {"created_at": "2023-04-19 18:26:08"}}
{"Q": "Is the FRIEND-XFP2QBD referral code still valid?", "A": "Yes, the FRIEND-XFP2QBD referral code is valid and provides a $150 referral discount.", "metadata": {"created_at": "2023-04-19 18:26:08"}}
{"Q": "Does Vibe offer any promotions for the Interactive Whiteboards?", "A": "Currently, there is no promotion except for the WELCOME100 offer for new customers.", "metadata": {"created_at": "2023-04-19 18:26:08"}}
{"Q": "Does Vibe offer free shipping in the US?", "A": "Yes, Vibe offers free shipping within the Continental US.", "metadata": {"created_at": "2023-04-19 18:26:08"}}
{"Q": "Can Vibe remove sales tax with a valid tax exemption certificate/form?", "A": "Yes, Vibe can help remove the taxes for sales tax exempt customers with a valid tax exemption certificate/form.", "metadata": {"created_at": "2023-04-19 18:26:08"}}
{"Q": "Are software or licensing monthly subscriptions required to use the Vibe S1 55 Inch Interactive Whiteboard?", "A": "No, there are no subscription costs required to use the Vibe S1 55 Inch Interactive Whiteboard or Vibe Canvas software at the moment.", "metadata": {"created_at": "2023-04-20 18:36:41"}}
{"Q": "If I purchase the 55\" interactive whiteboard, the camera, and the stand, do I need anything else to conduct virtual workshops?", "A": "No, you will only need to connect the interactive whiteboard to your WiFi network and download any necessary software such as Zoom, PPT, etc., keeping in mind that some third-party apps might require their own license or paid subscription.", "metadata": {"created_at": "2023-04-20 18:36:41"}}
{"Q": "What are the shipping lead times to TN?", "A": "The shipping time within the US is approximately 5-7 business days, with 1-2 days to process an order, as the products are in stock and readily available to ship from Southern California.", "metadata": {"created_at": "2023-04-20 18:36:41"}}
{"Q": "Is the Vibe Board S1 55'' the same as the original VIBE 55\" smartboard?", "A": "No, the Vibe Board S1 55\" is a newer upgraded model compared to the original 55\" Vibe board.", "metadata": {"created_at": "2023-04-20 18:50:46"}}
{"Q": "What is the main difference between the original Vibe 55\" board and the Vibe 55\" S1 board?", "A": "The main difference is the operating system and app compatibility. The original Vibe 55\" board is based on an Android operating system and supports mobile Android versions of most third-party apps, while the Vibe 55\" S1 board is based on a Chromium operating system and supports web versions of most applications. The S1 model is also Google Play store and Chrome web store compatible. Additionally, the 55\" S1 board can have an optional attachable camera, unlike the original.", "metadata": {"created_at": "2023-04-20 18:50:46"}}
{"Q": "Is there a camera option for the Vibe Board S1 55''?", "A": "Yes, the Vibe Board S1 55'' has an optional attachable camera.", "metadata": {"created_at": "2023-04-20 18:50:46"}}
{"Q": "What camera options are available for the Vibe S1 75 Inch Interactive Whiteboard?", "A": "For the Vibe S1 75 Inch Interactive Whiteboard, there is no built-in camera, and Vibe does not sell one specifically for it. However, it is compatible with most cameras that support standard Universal Video Class (UVC). Some tested and confirmed compatible cameras include:", "metadata": {"created_at": "2023-04-20 21:35:40"}}
{"Q": "How long do Vibe whiteboards typically take to ship within the US?", "A": "Shipping time within the US is approximately 5-7 business days, depending on your location.", "metadata": {"created_at": "2023-04-21 20:40:45"}}
{"Q": "Are there any discounts or sales currently available for Vibe whiteboards?", "A": "There are no current promotions, but new visitors can sign up for the WELCOME100 offer which gives a $100 discount for new customers.", "metadata": {"created_at": "2023-04-21 20:40:45"}}
{"Q": "What is the bulk discount offered by Vibe for whiteboards?", "A": "Vibe offers bulk discounts as follows: 3-5 boards: 5% discount, 6-10 boards: 10% discount, 11 and more: 15% discount.", "metadata": {"created_at": "2023-04-21 20:40:45"}}
{"Q": "Can the stands and cameras be purchased together with the Vibe S1 55\" whiteboard?", "A": "Yes, you can purchase the bundle including the S1 55\" board, stand, and camera on the Vibe website's product page.", "metadata": {"created_at": "2023-04-21 20:40:45"}}
{"Q": "What is included in Vibe's accident protection plan?", "A": "Vibe offers a free 1-year limited warranty covering manufacturer defects and extended warranties for up to 3 years that cover accidental forgiveness.", "metadata": {"created_at": "2023-04-21 20:40:45"}}
{"Q": "Can the Vibe S1 be used as a screen connected to my computer?", "A": "Yes, you can use HDMI or wirelessly cast your devices to the Vibe Board.", "metadata": {"created_at": "2023-04-24 17:57:50"}}
{"Q": "Does the Vibe S1 require network connectivity?", "A": "Vibe boards support offline mode for our Vibe Canvas application only. Other applications that require internet will not work. For first-time set up, it is advisable that the board is connected to the internet for updates.", "metadata": {"created_at": "2023-04-24 17:57:50"}}
{"Q": "Can the Vibe Canvas application operate in offline mode?", "A": "Yes, the Vibe Canvas application can operate in offline mode and save the different canvases created. It works similarly to how a computer operates without Wi-Fi but with its specific OS.", "metadata": {"created_at": "2023-04-24 17:57:50"}}
{"Q": "Is the level of customer support for a Vibe Board the same if purchased through Amazon as it is when purchasing directly through the site?", "A": "Yes, the customer support is the same regardless of whether the Vibe Board is purchased through Amazon or directly through our site.", "metadata": {"created_at": "2023-04-25 15:20:27"}}
{"Q": "Does the 30-day trial apply to boards purchased through Amazon?", "A": "Yes, the 30-day return policy applies to boards purchased through Amazon as well.", "metadata": {"created_at": "2023-04-25 15:20:27"}}
{"Q": "What should I do if my Vibe Canvas is stuck on the logo screen on a Vibe S1 55\" board?", "A": "Restart the board and check for updates for the Canvas app in the Vibe OS settings. If the issue persists, submit a support ticket to support@vibe.us with a video or picture of the issue.", "metadata": {"created_at": "2023-04-25 16:03:28"}}
{"Q": "Where can I buy the camera for the Vibe board?", "A": "The Vibe SmartCam C1 can be purchased on the Vibe website under the accessories list on the Interactive Smart Whiteboards shop page.", "metadata": {"created_at": "2023-04-25 16:03:28"}}
{"Q": "What operating system do Vibe boards run on?", "A": "Our Vibe boards run on Chromium OS.", "metadata": {"created_at": "2023-04-25 16:14:46"}}
{"Q": "Is Windows OS natively supported on Vibe Boards?", "A": "We currently do not run Windows OS natively on our Vibe Boards; however, we are working on this for later in 2023.", "metadata": {"created_at": "2023-04-25 16:14:46"}}
{"Q": "Can I get technical support regarding integration with Microsoft Azure?", "A": "Yes, you can schedule a meeting with our Technical Support Manager, Rhett, or learn more about single sign-on with Microsoft Azure at Vibe Help Center.", "metadata": {"created_at": "2023-04-25 16:14:46"}}
{"Q": "Do you have a Windows desktop app for Vibe Cast?", "A": "Yes, there is a desktop app for Vibe Cast available for download at cast.vibe.us, in addition to the option to use it directly from the web browser.", "metadata": {"created_at": "2023-04-25 17:52:03"}}
{"Q": "Is the Vibe Cast app or just a web browser access?", "A": "It is both; you can download the desktop app or use it directly from the web browser.", "metadata": {"created_at": "2023-04-25 17:52:03"}}
{"Q": "Does the Vibe Cast app version work on the original 55\" Vibe board?", "A": "No, the app version only works on the S1 55\" and 75\" Vibe boards.", "metadata": {"created_at": "2023-04-25 17:52:03"}}
{"Q": "What app works with the original 55\" Vibe board for screencasting?", "A": "Eshare should work with the original 55\" Vibe board.", "metadata": {"created_at": "2023-04-25 17:52:03"}}
{"Q": "How can I check the version of my Vibe board to know if it is original 55\" or S1 55\"?", "A": "The model number is on the sticker on the back of the board. If it was recently purchased, it is likely to be the S1 55\" since the original 55\" board has been phased out.", "metadata": {"created_at": "2023-04-25 17:52:03"}}
{"Q": "Where can I find the link for Eshare for the original Vibe board?", "A": "Eshare for the original Vibe board can be accessed here: https://vibe.how/en/articles/7055037-how-do-i-screencast-with-the-original-vibe-board-55.", "metadata": {"created_at": "2023-04-25 17:52:03"}}
{"Q": "Will Eshare work on the S1 55\" Vibe board?", "A": "No, Eshare won't work on the S1 55\" Vibe board due to the difference in OS.", "metadata": {"created_at": "2023-04-25 17:52:03"}}
{"Q": "How can a non-profit organization buy Vibe products without tax?", "A": "Non-profit organizations can receive a custom purchase link to complete orders without taxes by providing their billing/shipping address, contact name, contact number, item list, and a copy of their sales tax-exempt form.", "metadata": {"created_at": "2023-04-25 17:55:34"}}
{"Q": "Does the Vibe board come with a camera and stand included?", "A": "No, those are add-ons and do not come included with the board.", "metadata": {"created_at": "2023-04-25 18:19:09"}}
{"Q": "What is the total cost for a Vibe board plus webcam plus stand?", "A": "The total would be $3,799 USD without sales tax.", "metadata": {"created_at": "2023-04-25 18:19:09"}}
{"Q": "Are there any discounts available for the Vibe board?", "A": "A WELCOME100 discount can be applied to the order, which is a $100 discount for first-time customers.", "metadata": {"created_at": "2023-04-25 18:19:09"}}
{"Q": "Can the Vibe board be mounted on the wall?", "A": "Yes, the board can be wall-mounted.", "metadata": {"created_at": "2023-04-25 18:19:09"}}
{"Q": "Are there any cheaper alternatives for the stand?", "A": "Customers can consider other third-party stands which are more cost-effective.", "metadata": {"created_at": "2023-04-25 18:19:09"}}
{"Q": "Can state universities receive tax exemption when placing an order with Vibe?", "A": "Yes, state universities can place an order without taxes. Vibe requires the university's billing/shipping address, contact name, contact number, item name, and quantity, as well as a copy of the sales tax-exempt form to make tax adjustments.", "metadata": {"created_at": "2023-04-25 19:12:41"}}
{"Q": "Can Vibe provide a custom purchase link for tax-exempt orders?", "A": "Yes, Vibe can provide a custom purchase link to complete orders without taxes for eligible customers like state universities.", "metadata": {"created_at": "2023-04-25 19:12:41"}}
{"Q": "Does Vibe accept purchase orders with payment terms?", "A": "Yes, Vibe accepts purchase orders with net 30 terms.", "metadata": {"created_at": "2023-04-25 19:12:41"}}
{"Q": "Can I use a Microsoft Teams or Calendar Resource account with Vibe Boards?", "A": "Yes, the S1 55\" and 75\" Vibe Boards support many third-party apps including the use of Microsoft Teams or Calendar Resource accounts, especially when using Google Workspace. For non-vetted apps, the user experience cannot be guaranteed.", "metadata": {"created_at": "2023-04-25 20:41:33"}}
{"Q": "Can Office 365 manage a shared (resource) account for 1-click meetings on Vibe Boards?", "A": "To get information on managing a shared resource account on Vibe Boards with Office 365, you will need to contact the support team at support@vibe.us or submit a support ticket in the Vibe Knowledge Base.", "metadata": {"created_at": "2023-04-25 20:41:33"}}
{"Q": "Can Vibe boards be used strictly for video conferencing?", "A": "Yes, Vibe boards can be used for video conferencing and support many third-party apps, including video conferencing apps.", "metadata": {"created_at": "2023-04-25 22:49:20"}}
{"Q": "Do the Vibe boards come with a camera, speaker, or microphone?", "A": "Vibe boards have built-in speakers but no microphones. You can connect a USB microphone or a camera with microphone capabilities.", "metadata": {"created_at": "2023-04-25 22:49:20"}}
{"Q": "Does the camera compatible with Vibe boards come with a microphone?", "A": "Yes, the Vibe SmartCam has built-in microphones.", "metadata": {"created_at": "2023-04-25 22:49:20"}}
{"Q": "Does the Vibe S1 75 Inch board come with a camera?", "A": "No, the 75\" board does not come included with a camera, but it is compatible with most standard Universal Video Class (UVC) cameras that have been tested.", "metadata": {"created_at": "2023-04-25 22:49:20"}}
{"Q": "Does the Vibe 55\" board support HDMI-ARC to a sound bar?", "A": "No, Vibe boards do not support sound bars with ARC.", "metadata": {"created_at": "2023-04-26 17:13:48"}}
{"Q": "Can external speakers be connected to the Vibe board?", "A": "Yes, you can connect external USB-C or USB to USB-C speakers to the board.", "metadata": {"created_at": "2023-04-26 17:13:48"}}
{"Q": "Do you have any government contracts?", "A": "We do not, but you can consider a reseller who has a government contract.", "metadata": {"created_at": "2023-04-26 19:27:42"}}
{"Q": "Do you accept purchase orders (PO)?", "A": "Yes, we accept POs with net 30 terms.", "metadata": {"created_at": "2023-04-26 19:27:42"}}
{"Q": "What is the estimated delivery time for your products?", "A": "All our products are in stock and available to ship. It typically takes 1-2 days to process an order. Shipping time within the US is 5-7 business days, depending on your location (our warehouses are in Southern California).", "metadata": {"created_at": "2023-04-26 19:27:42"}}
{"Q": "Is there a trial period for Vibe products?", "A": "Vibe does not offer a trial period, but there is a 30 days return policy where the customer can return the device within 30 days of delivery date, covering only the cost of shipping back to the warehouse.", "metadata": {"created_at": "2023-04-27 13:28:51"}}
{"Q": "Can I schedule a demonstration of the Vibe product before purchasing?", "A": "Yes, you can schedule a demonstration of our product to speak with one of our experts who will show you the product and answer any questions you may have.", "metadata": {"created_at": "2023-04-27 13:28:51"}}
{"Q": "Does the Vibe Board S1 55\" support a remote control?", "A": "The Vibe Board S1 55\" does not come with a remote control, but you can use the VibeOne app on your phone as a remote to control volume, brightness, navigate with a touchpad, and utilize a digital keyboard.", "metadata": {"created_at": "2023-04-27 13:49:45"}}
{"Q": "Can a USB remote work with the Vibe Board S1 55\"?", "A": "Yes, a USB remote should work with the Vibe Board S1 55\".", "metadata": {"created_at": "2023-04-27 13:49:45"}}
{"Q": "Do you offer a Bluetooth remote for the Vibe Board S1 55\"?", "A": "Vibe does not offer a Bluetooth remote for the Vibe Board S1 55\", but they have tested and recommend a specific USB remote instead.", "metadata": {"created_at": "2023-04-27 13:49:45"}}
{"Q": "Do you offer a 30-day return policy?", "A": "Yes, Vibe offers a 30-day return policy. If you are not satisfied with your purchase, you can return the device within 30 days of delivery and only cover the cost of shipping back to the warehouse.", "metadata": {"created_at": "2023-04-27 13:49:45"}}
{"Q": "Does Vibe price match their Amazon pricing if I buy through the Vibe website?", "A": "Vibe does not price match, but you can use the WELCOME100 code to get a discount on the Vibe website, or purchase via Amazon if you prefer.", "metadata": {"created_at": "2023-04-27 13:49:45"}}
{"Q": "Does Vibe offer bulk discounts for large orders?", "A": "Yes, Vibe offers bulk discounts: 5% discount for 3-5 boards, 10% discount for 6-10 boards, 11 or more boards get a 15% discount.", "metadata": {"created_at": "2023-04-27 13:49:45"}}
{"Q": "What is the shipping time for orders within the US?", "A": "Vibe orders typically take 1-2 days to process, and shipping within the US is approximately 5-7 business days, depending on your location.", "metadata": {"created_at": "2023-04-27 13:49:45"}}
{"Q": "Where do Vibe orders ship from?", "A": "Vibe orders are shipped from warehouses located in California and Delaware, depending on proximity to the destination and inventory availability.", "metadata": {"created_at": "2023-04-27 13:49:45"}}
{"Q": "Can USB 360 degree conference cameras and Jabra conference speaker/mic arrays work with Vibe boards?", "A": "Yes, you can connect USB 360 degree conference cameras and speakers to Vibe boards. A list of tested cameras and mics that can be used on Vibe boards includes eMeet C980 Pro Webcam, Logitech BRIO, Logitech Conference Cam Bcc950, Logitech Meetup, Meeting Owl Pro, Poly Studio P15, Jabra SPEAK 510+, Jabra SPEAK 710, Emeet M2, and Emeet M220.", "metadata": {"created_at": "2023-04-27 14:20:17"}}
{"Q": "Does the Meeting Owl 3 work with Vibe boards?", "A": "The Meeting Owl 3 should work with Vibe boards, as the tested Meeting Owl Pro is compatible.", "metadata": {"created_at": "2023-04-27 14:20:17"}}
{"Q": "When will the Vibe Board Pro 75\" be available in the UK?", "A": "There is no timeline for the availability of the Vibe Board Pro 75\" in the UK.", "metadata": {"created_at": "2023-04-27 14:29:25"}}
{"Q": "Is the Vibe Board Pro 75\" available in the US?", "A": "Yes, the Vibe Board Pro 75\" is available in the US.", "metadata": {"created_at": "2023-04-27 14:29:25"}}
{"Q": "What is included with the Vibe Board Pro 75\"?", "A": "The Vibe Board Pro 75\" comes with pens, but it does not come with a camera.", "metadata": {"created_at": "2023-04-27 14:29:25"}}
{"Q": "Are there any compatible cameras for the Vibe Board Pro 75\"?", "A": "Yes, most cameras that support standard Universal Video Class (UVC) should work with the Vibe Board Pro 75\", and several mainstream cameras have been tested for compatibility.", "metadata": {"created_at": "2023-04-27 14:29:25"}}
{"Q": "Can you ensure delivery by a specific date, such as May 8th?", "A": "We are working to get the best price for inside delivery and will follow up with a quote as soon as we receive an update regarding the shipping cost. Options for delivery by a specific date will be provided.", "metadata": {"created_at": "2023-04-27 16:53:13"}}
{"Q": "Can I request different delivery options for multiple products, for example, one delivered by a certain date and the other by regular schedule?", "A": "Yes, you can request different delivery options for multiple products. We'll provide options such as both boards delivered by May 8th, one board delivered by May 8th with the other following the regular shipping schedule, and both boards delivered without expedited shipping.", "metadata": {"created_at": "2023-04-27 16:53:13"}}
{"Q": "What is the shipping time for a S1 Vibe board within the US?", "A": "Shipping within the US typically takes about 5-7 business days, depending on location, with 1-2 days for order processing.", "metadata": {"created_at": "2023-04-27 18:40:21"}}
{"Q": "Can the Vibe S1 55 Inch Interactive Whiteboard be delivered in Washington State before June 30th?", "A": "Yes, if ordered now, it would be delivered way before June 30th, even with standard free shipping.", "metadata": {"created_at": "2023-04-27 18:40:21"}}
{"Q": "Can I get a quote for the Vibe S1 55 Inch Interactive Whiteboard with the stand and camera?", "A": "Yes, a quote can be provided for the requested items.", "metadata": {"created_at": "2023-04-27 18:40:21"}}
{"Q": "Does Vibe offer any discounts for returning customers?", "A": "Yes, an exclusive customer discount may be applied for customers who have purchased Vibe boards previously.", "metadata": {"created_at": "2023-04-27 18:40:21"}}
{"Q": "Is Green River College tax-exempt for purchases?", "A": "No, the college is not tax-exempt in Vibe's system and has to pay tax on purchases.", "metadata": {"created_at": "2023-04-27 18:40:21"}}
{"Q": "What color options are available for the Vibe stand?", "A": "The color options for the Vibe stand are white, red, blue, or green.", "metadata": {"created_at": "2023-04-27 18:40:21"}}
{"Q": "What should I do if an item is missing from my Vibe order upon delivery?", "A": "You should provide the order number to the sales team, so they can check the shipment details and create a support ticket to resolve the issue.", "metadata": {"created_at": "2023-04-27 22:15:23"}}
{"Q": "If my Vibe C1 AI Camera was not included in the delivery, how will Vibe address this?", "A": "The sales team will investigate the situation by confirming the delivery details and then create a support ticket on your behalf to get the issue resolved by the support team.", "metadata": {"created_at": "2023-04-27 22:15:23"}}
{"Q": "Can we edit and collaborate using Google Office on Vibe boards?", "A": "Yes, you can use Google Office on the Vibe boards and edit your documents.", "metadata": {"created_at": "2023-04-28 13:49:33"}}
{"Q": "Are Vibe boards compatible with third-party apps?", "A": "Vibe boards support many third-party apps, and a list of vetted apps is maintained. Google Play Store and the Chrome web store can be enabled for additional downloads.", "metadata": {"created_at": "2023-04-28 13:49:33"}}
{"Q": "Can I use Android apps that aren't on Vibe's vetted app list?", "A": "For Android apps not on the vetted app list, you should reach out to Vibe to check if they can be supported.", "metadata": {"created_at": "2023-04-28 13:49:33"}}
{"Q": "Can the Vibe SmartCam be mounted on top of the Vibe board if the board is wall-mounted?", "A": "Yes, the SmartCam can be mounted to a unique slot on top of the board even when wall-mounted.", "metadata": {"created_at": "2023-04-28 15:01:54"}}
{"Q": "Are Bluetooth headphones/mics able to connect to the Vibe board for calls?", "A": "Bluetooth speakers or headsets can connect for playing audio, but Bluetooth calls, recording, or video/audio conferencing are not supported.", "metadata": {"created_at": "2023-04-28 15:01:54"}}
{"Q": "Can USB microphones be used with Vibe boards?", "A": "Yes, USB microphones are supported, including ones with a dongle which can be used wirelessly.", "metadata": {"created_at": "2023-04-28 15:01:54"}}
{"Q": "Does the Vibe board support split-screen mode where one half can be used for screencasting or Apple TV and the other half for a Vibe app?", "A": "Yes, the boards support split-screen mode allowing different activities on each half of the screen.", "metadata": {"created_at": "2023-04-28 15:01:54"}}
{"Q": "Are there Vibe wall mounts that allow the board to be easily removed for placement on a stand?", "A": "There is no specific version of wall mount designed for easy removal and placement on a stand; it might be a cumbersome process that could require two people due to the need to screw and unscrew the board.", "metadata": {"created_at": "2023-04-28 15:01:54"}}
{"Q": "What is the price of the Vibe S1 55\" Interactive Whiteboard?", "A": "The price of the 55\" Vibe S1 Board with a 4K touchscreen, an i5 Processor, and Wi-Fi 6 support can be found on the Vibe website with different bundle options.", "metadata": {"created_at": "2023-04-28 15:14:47"}}
{"Q": "What items are included within the box of the Vibe S1 55\" board?", "A": "Inside the box of the Vibe S1 55\" board you will get the Vibe Board S1 55\", Stylus x1, Power cord, and Quick start guide.", "metadata": {"created_at": "2023-04-28 15:14:47"}}
{"Q": "How much does the Vibe 75\" Interactive Digital Whiteboard cost?", "A": "The Vibe 75\" Interactive Digital Whiteboard costs $6,999 USD.", "metadata": {"created_at": "2023-04-28 15:14:47"}}
{"Q": "What items are included within the box of the Vibe 75\" board?", "A": "The box of the Vibe 75\" board includes the Vibe 75\" board, Stylus x2, Wall mount, Remote controller, HDMI cord & USB cable, Power cord, and Quick start guide.", "metadata": {"created_at": "2023-04-28 15:14:47"}}
{"Q": "What is the cost of the stand for the Vibe 75\" Interactive Digital Whiteboard?", "A": "The stand for the Vibe 75\" Interactive Digital Whiteboard costs an additional $899 USD.", "metadata": {"created_at": "2023-04-28 15:14:47"}}
{"Q": "Does Vibe offer any discounts for interior designers?", "A": "Vibe does not offer a specific designer discount, but there are bulk discounts for purchases of 3 or more boards and a Vibe Reseller Program with a reseller discount.", "metadata": {"created_at": "2023-04-28 15:14:47"}}
{"Q": "Can I get a discount on a single board purchase?", "A": "Yes, for a single board purchase, you might come across a WELCOME100 offer on the Vibe website for new visitors, where you can sign up with your email and receive a $100 offer towards your purchase of a Vibe board.", "metadata": {"created_at": "2023-04-28 15:14:47"}}
{"Q": "Can I link the Vibe Board to my iPad?", "A": "Yes, you can wirelessly cast your iPad to the Vibe Board, but be aware that Airplay doesn't support casting certain streaming services due to piracy concerns.", "metadata": {"created_at": "2023-04-28 20:44:04"}}
{"Q": "Does the Vibe Board have an application where I can write like a whiteboard?", "A": "Yes, the Vibe Board has the Vibe Canvas application, which is a whiteboarding software that provides an excellent handwriting experience.", "metadata": {"created_at": "2023-04-28 20:44:04"}}
{"Q": "Is the Vibe Board Wi-Fi enabled?", "A": "Yes, the Vibe Board is Wi-Fi enabled and can also be connected using an Ethernet cable.", "metadata": {"created_at": "2023-04-28 20:44:04"}}
{"Q": "Is there any training or resources available for using Vibe in teaching?", "A": "There are resources available, including a 20-minute demo called \"Teaching with Vibe,\" case studies from educators, and additional resources from top universities. Additionally, you can try the free Vibe whiteboarding software via the Vibe web app and watch a product tour.", "metadata": {"created_at": "2023-04-28 20:44:04"}}
{"Q": "Is there an instore location in Miami where I can buy and pick up a Vibe 75-inch interactive whiteboard?", "A": "No, there isn't an instore location to buy our Vibe boards; purchases can be made online on our website or via Amazon.", "metadata": {"created_at": "2023-04-28 20:47:15"}}
{"Q": "Can I get expedited shipping for the Vibe 75-inch interactive whiteboard?", "A": "We are not set up for expedited shipping online currently, but we can check with our Logistics team to see if it's possible and to provide the cost.", "metadata": {"created_at": "2023-04-28 20:47:15"}}
{"Q": "What is the earliest ship date available for the Vibe 75-inch interactive whiteboard?", "A": "The earliest ship date would be on Monday, considering the cut-off time for delivery options for Monday has already passed.", "metadata": {"created_at": "2023-04-28 20:47:15"}}
{"Q": "How can I connect my device to present on PowerPoint with my Vibe interactive whiteboard?", "A": "A support ticket will be created, and a technical support expert will reach out to assist with the issue of connecting to present on PowerPoint with the Vibe interactive whiteboard.", "metadata": {"created_at": "2023-05-01 13:25:05"}}
{"Q": "Where do I enter the discount code when ordering a Vibe product?", "A": "You would enter the discount code at checkout.", "metadata": {"created_at": "2023-05-01 14:14:17"}}
{"Q": "What should I do if I’m having trouble sending screenshots or images through the chat?", "A": "If there are issues with sending images, our sales team can provide you with a custom purchase link with the discount applied.", "metadata": {"created_at": "2023-05-01 14:14:17"}}
{"Q": "Do you offer any other discount codes apart from the one I have?", "A": "Unfortunately, we do not have any other discount codes available at the time.", "metadata": {"created_at": "2023-05-01 14:14:17"}}
{"Q": "What information do you need to create a custom purchase link?", "A": "We need your billing/shipping address, contact name, contact number, and the name and number of items you would like to purchase. If you are sales tax exempt, we also need a copy of your sales tax-exempt form.", "metadata": {"created_at": "2023-05-01 14:14:17"}}
{"Q": "Can I add accessories, such as the camera, to my order for the Vibe 55?", "A": "Yes, you can add accessories like the camera to your order.", "metadata": {"created_at": "2023-05-01 14:14:17"}}
{"Q": "What do I need to provide if I have a sales tax exemption?", "A": "You need to provide a copy of your actual tax exemption form or certificate.", "metadata": {"created_at": "2023-05-01 14:14:17"}}
{"Q": "How can I change the company name on my order for tax exemption purposes?", "A": "You can clarify with the sales team that the office name is different, and they will adjust the company name on the order accordingly.", "metadata": {"created_at": "2023-05-01 14:14:17"}}
{"Q": "What is the length and the cost of the warranty for the 75\" Vibe Interactive Whiteboard?", "A": "The 75\" Vibe Interactive Whiteboard comes with a standard 1-year manufacturer warranty. The cost for extended warranty is $350 for 1 additional year, $625 for 2 additional years, and $850 for 3 additional years.", "metadata": {"created_at": "2023-05-01 14:25:37"}}
{"Q": "Where can I see the Vibe in person?", "A": "Currently, there isn't a physical location where you can see the Vibe Board. However, you can schedule a virtual demo or watch a product tour and videos from our YouTube channel.", "metadata": {"created_at": "2023-05-01 14:49:46"}}
{"Q": "How can I try the Vibe software?", "A": "You can try the Vibe software for free by going to app.vibe.us.", "metadata": {"created_at": "2023-05-01 14:49:46"}}
{"Q": "Where can I find a product tour?", "A": "A 4 min product tour is available and can be found through the information provided by our sales team.", "metadata": {"created_at": "2023-05-01 14:49:46"}}
{"Q": "How is the demo for the Vibe board conducted?", "A": "The demo will be hosted virtually via Zoom by an Account Executive who will provide a walkthrough of the Vibe board and answer any questions.", "metadata": {"created_at": "2023-05-01 14:49:46"}}
{"Q": "Do you offer discounts for nonprofits?", "A": "We do not have a specific discount for nonprofits, but nonprofits can use the WELCOME100 code for $100 off the first order. We also offer bulk discounts for purchases of 3 or more boards. Additionally, sales tax can be removed for tax-exempt organizations with a valid tax-exempt certificate.", "metadata": {"created_at": "2023-05-01 16:18:34"}}
{"Q": "Can you waive sales tax for tax-exempt organizations?", "A": "Yes, we can remove the sales tax for tax-exempt organizations upon provision of a valid sales tax-exemption certificate.", "metadata": {"created_at": "2023-05-01 16:18:34"}}
{"Q": "What product options are available for the Vibe 55 inch smart board?", "A": "Customers can purchase the 55 inch smart board along with its stand and camera, as a package outlined on our website.", "metadata": {"created_at": "2023-05-01 16:18:34"}}
{"Q": "Do the Vibe stands come in different colors?", "A": "Yes, Vibe stands are available in white, red, blue, or green.", "metadata": {"created_at": "2023-05-01 16:18:34"}}
{"Q": "Does Vibe offer free shipping?", "A": "Yes, Vibe offers free standard shipping within the US.", "metadata": {"created_at": "2023-05-01 16:18:34"}}
{"Q": "How long does it typically take to process and ship an order within the US?", "A": "The order processing time is 1-2 days, and shipping within the US typically takes about 5-7 business days, depending on location.", "metadata": {"created_at": "2023-05-01 16:18:34"}}
{"Q": "Does Vibe offer a trial period for products?", "A": "Vibe offers a 30-day return policy. If you are not satisfied with the product, you can return it within 30 days of delivery, but you will need to cover the cost of shipping back to the warehouse.", "metadata": {"created_at": "2023-05-01 16:18:34"}}
{"Q": "Does Vibe provide an option for monthly payments?", "A": "Vibe partners with Affirm to offer monthly payment options over 6, 9, or 12 months. Interest rates and approval are subject to Affirm's terms and conditions.", "metadata": {"created_at": "2023-05-01 16:18:34"}}
{"Q": "Are there business options for using Affirm?", "A": "It is unclear if Affirm provides a specific business option, and customers may need to contact Affirm directly via their help center to inquire about any business-related financing questions.", "metadata": {"created_at": "2023-05-01 16:18:34"}}
{"Q": "What is the difference between the Vibe S1 55\" and 75\" interactive whiteboards?", "A": "The main difference is the size and the price. Both boards run on Chromium OS and have similar capabilities. The Vibe S1 55\" can have an attachable camera (SmartCam) purchased as part of a bundle, while the Vibe S1 75\" Pro is compatible with most cameras that support standard Universal Video Class (UVC).", "metadata": {"created_at": "2023-05-01 16:41:58"}}
{"Q": "Does the Vibe S1 55\" come with a passive or active stylus?", "A": "The Vibe S1 55\" comes with a passive stylus for writing and making selections on the board; it has no buttons or special features.", "metadata": {"created_at": "2023-05-01 16:41:58"}}
{"Q": "What features does the active stylus have?", "A": "The active stylus has three buttons for the eraser and page up and down functions.", "metadata": {"created_at": "2023-05-01 16:41:58"}}
{"Q": "What bulk discount does Vibe offer?", "A": "Vibe offers the following bulk discounts: 3-5 boards: 5% discount, 6-10 boards: 10% discount, and 11 or more boards: 15% discount.", "metadata": {"created_at": "2023-05-01 16:41:58"}}
{"Q": "What is Vibe's return policy for their interactive boards?", "A": "Vibe offers a 30-day return policy where customers can return the device within 30 days of the delivery date and would only need to cover the cost of shipping back to the warehouse.", "metadata": {"created_at": "2023-05-01 16:41:58"}}
{"Q": "Can you get a better discount for a single board to test out?", "A": "There is no current promotion for single board testing, however, new visitors to the Vibe website may come across a random pop-up to sign up for the WELCOME100 offer, which provides a $100 discount towards the purchase of a Vibe board.", "metadata": {"created_at": "2023-05-01 16:41:58"}}
{"Q": "How long does shipping take within the US?", "A": "Shipping time within the US is approximately 5-7 business days, after a processing time of 1-2 days.", "metadata": {"created_at": "2023-05-01 17:10:03"}}
{"Q": "Can we use Excel on the Vibe interactive whiteboards?", "A": "Yes, Vibe Boards support Microsoft Office apps and many third-party apps, and users can access vetted apps or download additional ones from the Google Play Store or the Chrome Web Store.", "metadata": {"created_at": "2023-05-01 17:10:03"}}
{"Q": "Does the 75\" Vibe Board have a USB plug for a keyboard and mouse?", "A": "(The conversation does not explicitly confirm this, but it is implied that you can connect a keyboard and mouse. Please schedule a demo for detailed specifications.)", "metadata": {"created_at": "2023-05-01 17:10:03"}}
{"Q": "How does the profile setup work on the Vibe Board?", "A": "To understand how profile setup works on the Vibe Board, including whether it's connected to a domain or server, it would be best to join a live demo. (The conversation directs the customer to schedule a demo with an expert for an in-depth explanation.)", "metadata": {"created_at": "2023-05-01 17:10:03"}}
{"Q": "Why are only the volume and brightness buttons working on my Vibe whiteboard remote?", "A": "Only a select number of buttons on the remote are programmed for use with the board. Please press the \"Ok\" button before pressing other buttons, and ensure to point directly at the power light on the board.", "metadata": {"created_at": "2023-05-01 18:28:21"}}
{"Q": "How can I connect a laptop with HDMI if other functions on the remote do not work?", "A": "You can still use the provided remote to switch to HDMI input for connecting a laptop.", "metadata": {"created_at": "2023-05-01 18:28:21"}}
{"Q": "Do I need a USB cable to connect to the display?", "A": "The USB cable is necessary for the touchback functionality when using HDMI. However, HDMI alone should allow screen casting without touchback control.", "metadata": {"created_at": "2023-05-01 18:28:21"}}
{"Q": "I'm unable to screen cast. What should I do?", "A": "If the initial troubleshooting provided by the sales assistant does not resolve the issue, please reach out to Vibe support at support@vibe.us or submit a support ticket for further assistance.", "metadata": {"created_at": "2023-05-01 18:28:21"}}
{"Q": "Is there a lead time on Vibe boards?", "A": "All our products are in stock and available to ship. It typically takes 1-2 days to process an order. Shipping time within the US is approximately 5-7 business days.", "metadata": {"created_at": "2023-05-01 18:29:47"}}
{"Q": "How can I apply the $100 discount on the website?", "A": "The $100 discount can be applied by entering the code WELCOME100 during checkout on the Vibe website.", "metadata": {"created_at": "2023-05-01 18:29:47"}}
{"Q": "Does the 75\" Vibe board come with a camera?", "A": "The Vibe S1 75 Inch Interactive Whiteboard does not have a built-in camera. However, cameras that support the Universal Video Class (UVC) standard should work with the device, and a list of compatible cameras can be found on the Vibe website.", "metadata": {"created_at": "2023-05-01 18:29:47"}}
{"Q": "Can Vibe boards connect to each other for meetings with interaction on the whiteboard?", "A": "Yes, Vibe boards can connect via cloud-based software for shared collaborations whether through additional Vibe Boards, computer browsers, or tablets, as long as there is WiFi available.", "metadata": {"created_at": "2023-05-01 18:29:47"}}
{"Q": "Are there any bulk purchase discounts available?", "A": "A volume discount is available for the purchase of 3 boards. There are no volume discounts for two boards, but a discount on the third board might be arranged.", "metadata": {"created_at": "2023-05-01 18:29:47"}}
{"Q": "Is free shipping available in the US?", "A": "Yes, free curbside delivery is offered in the US, there's no need to pay additional for shipping unless there are special delivery requirements.", "metadata": {"created_at": "2023-05-01 18:29:47"}}
{"Q": "What is the standard delivery time after placing an order?", "A": "After placing an order, it typically takes 1-2 days to process, and the shipping time within the US is approximately 5-7 business days.", "metadata": {"created_at": "2023-05-01 18:29:47"}}
{"Q": "If I place an order today for a 75\" interactive whiteboard, when will it arrive to zip code 29909?", "A": "Shipping time is estimated to be 5-7 business days after 1-2 days of order processing, but rush options may be available upon request.", "metadata": {"created_at": "2023-05-02 13:08:01"}}
{"Q": "Is there a rush shipping option available for the Vibe S1 75 Inch Interactive Whiteboard?", "A": "Yes, rush shipping options may be available and can be discussed by providing the full shipping address so a quote can be created.", "metadata": {"created_at": "2023-05-02 13:08:01"}}
{"Q": "What TV mount can I use for the 75\" Vibe Board and the 55\" S1 Vibe Board?", "A": "For the 75\" Vibe Board, it comes with a complimentary wall mount included. For the S1 55\" Vibe Board, most TV wall mounts that support VESA 200X200 and can support at least 65 pounds should work. The supported screw model is M6 with a length between 12-20mm.", "metadata": {"created_at": "2023-05-02 15:47:05"}}
{"Q": "Does the complimentary mount for the 75\" Vibe Board allow you to pull it out and swivel?", "A": "No, the mount that comes with the 75\" Vibe Board doesn't articulate.", "metadata": {"created_at": "2023-05-02 15:47:05"}}
{"Q": "Can third-party wall mounts work with the 75\" Vibe Board?", "A": "Yes, third-party wall mounts will work with the 75\" Vibe Board as long as they support 800 x 400 mm VESA and can support at least 108 lbs.", "metadata": {"created_at": "2023-05-02 15:47:05"}}
{"Q": "Does the Vibe Smart Touch Remote work with all vibe boards? Specifically Model S5501AUS", "A": "The Vibe Board S1 55\" does not have a remote. However, you can use the VibeOne app to control certain features of the board.", "metadata": {"created_at": "2023-05-02 20:00:20"}}
{"Q": "Can the VibeOne app change inputs on the Vibe Board S1 55\"?", "A": "No, changing inputs using the VibeOne app is not possible.", "metadata": {"created_at": "2023-05-02 20:00:20"}}
{"Q": "How do I claim the $300 savings for the 55\" model?", "A": "The $300 savings refers to free standard shipping throughout the Continental US, which is applied at checkout.", "metadata": {"created_at": "2023-05-02 21:35:38"}}
{"Q": "Does the Vibe S1 55 Inch Interactive Whiteboard have an HDMI out?", "A": "No, the Vibe S1 does not have an HDMI out. You will need to use a USB-C to HDMI adapter for the S1 board.", "metadata": {"created_at": "2023-05-02 21:35:38"}}
{"Q": "What is the WELCOME100 offer?", "A": "The WELCOME100 offer is a $100 discount for new visitors who sign up on the Vibe website.", "metadata": {"created_at": "2023-05-02 21:35:38"}}
{"Q": "Is there a difference between the Vibe S1 55\" and the 75\" model other than size?", "A": "The main differences are size and price. Both models run on Chromium OS and offer similar capabilities.", "metadata": {"created_at": "2023-05-02 21:35:38"}}
{"Q": "Are there any cameras that are compatible with the Vibe S1 75 Inch Interactive Whiteboard?", "A": "Yes, most cameras compatible with Universal Video Class (UVC) should work, including eMeet C980 Pro Webcam, Logitech BRIO, Logitech Conference Cam Bcc950, Logitech Meetup, Meeting Owl Pro, and Poly Studio P15.", "metadata": {"created_at": "2023-05-02 21:35:38"}}
{"Q": "Can the USB or USB C ports on the Vibe Board be used for output to broadcast computer as an HDMI input?", "A": "Yes, the Vibe Board's USB C Port 2 - Display Port Out can be used to output directly to a broadcast computer as an HDMI input.", "metadata": {"created_at": "2023-05-02 22:06:27"}}
{"Q": "Are Vibe smartboards used in education?", "A": "Yes, our boards have been used in the education environment.", "metadata": {"created_at": "2023-05-03 13:30:09"}}
{"Q": "Are the smartboards mountable?", "A": "Yes, our boards are mountable.", "metadata": {"created_at": "2023-05-03 13:30:09"}}
{"Q": "Can external speakers be connected to the Vibe board?", "A": "Yes, you can connect external speakers to the Vibe board, including USB and USB-C connected speakers.", "metadata": {"created_at": "2023-05-03 14:54:42"}}
{"Q": "Do the Vibe boards have a USB-C connection for audio?", "A": "The 55\" S1 board has a USB-C connection for audio, while the 75\" board has a USB connection.", "metadata": {"created_at": "2023-05-03 14:54:42"}}
{"Q": "Do the Vibe boards include built-in microphones?", "A": "No, the Vibe boards have built-in speakers but no microphones.", "metadata": {"created_at": "2023-05-03 14:54:42"}}
{"Q": "What is the process to become a Vibe reseller?", "A": "To become a reseller, you need to send in your valid Reseller Certificate and W9. For a quote, you'll have to include the Vibe products and quantity you're interested in along with the shipping address. A reseller agreement may be required for orders of 5 or more Vibe Smartboards or accumulated sales of over 15 Vibe Smartboards.", "metadata": {"created_at": "2023-05-03 14:54:42"}}
{"Q": "Where can I find a demo or intro to the Vibe board?", "A": "There is a 4-minute product tour available, as well as tutorial and feature videos on the Vibe YouTube channel that demonstrate how the boards work.", "metadata": {"created_at": "2023-05-03 14:54:42"}}
{"Q": "How can I arrange a virtual demo of the Vibe board with my client?", "A": "You can schedule a virtual demo with a Vibe account executive by following the provided link and setting up a session.", "metadata": {"created_at": "2023-05-03 14:54:42"}}
{"Q": "Where can I find retail pricing for Vibe boards?", "A": "The Manufacturer's Suggested Retail Price (MSRP) is displayed on the Vibe website. Prices for the S1 55\" is $3199 and $3299, for S1 75\" it's $5799, and for Pro 75\" it's $6299.", "metadata": {"created_at": "2023-05-03 14:54:42"}}
{"Q": "Can Vibe ship to international locations?", "A": "Currently, Vibe only ships within the US.", "metadata": {"created_at": "2023-05-03 15:33:08"}}
{"Q": "What is included in the box with the Vibe S1 55\" Interactive Whiteboard?", "A": "Within the box you will get the Vibe Board S1 55\", one stylus, a power cord, and a quick start guide.", "metadata": {"created_at": "2023-05-03 15:33:08"}}
{"Q": "What is included in the box with the Vibe S1 75\" Interactive Whiteboard?", "A": "Within the box you will get the Vibe Board Pro 75\", two styluses, a wall mount, a remote control, an HDMI cord & USB cable, a power cord, and a quick start guide.", "metadata": {"created_at": "2023-05-03 15:33:08"}}
{"Q": "Is there an additional cost for a stand with the Vibe S1 75\" Interactive Whiteboard?", "A": "Yes, the stand is an additional cost of $899 USD.", "metadata": {"created_at": "2023-05-03 15:33:08"}}
{"Q": "What should I do if I want a quote for Vibe products?", "A": "Please use the Request a Quote page on the Vibe website to submit your information and our team will get in touch with a quote.", "metadata": {"created_at": "2023-05-03 15:33:08"}}
{"Q": "Does Vibe sell SMART boards?", "A": "No, Vibe does not sell SMART boards, only Vibe boards.", "metadata": {"created_at": "2023-05-03 15:33:08"}}
{"Q": "Can a Vibe device be connected to a room PA system?", "A": "The audio output from the Vibe boards is usually USB or Bluetooth speakers.", "metadata": {"created_at": "2023-05-03 17:28:45"}}
{"Q": "Do we need multiple accounts to make use of the Vibe Canvas software?", "A": "Yes, each user needs a separate account, which is free of cost. For a single board, you can create a single sign-in or different user logins, and for accessing from multiple devices like laptops or tablets, separate accounts can be created.", "metadata": {"created_at": "2023-05-03 17:28:45"}}
{"Q": "Is there a way to wipe the board after each session for privacy in a university setting?", "A": "It is suggested to join a demo to see how the Vibe boards work, as this will help in exploring the best solution for user management and privacy in a university setting, where multiple users access the equipment.", "metadata": {"created_at": "2023-05-03 17:28:45"}}
{"Q": "How can we become a registered Vibe reseller?", "A": "To become a Vibe reseller, visit the Vibe Reseller Program website and fill in the Vibe Reseller Partner form. Additionally, provide your resale certificate, W-9, and tax forms through the email \"Following up! Vibe reseller opportunity.\"", "metadata": {"created_at": "2023-05-03 18:14:24"}}
{"Q": "How can I get an official reseller quote for Vibe products?", "A": "Once you have provided your resale certificate, W-9, and tax forms, a member of the sales team will reach out and provide you with an official reseller quote.", "metadata": {"created_at": "2023-05-03 18:14:24"}}
{"Q": "What are the VESA measurements for the Vibe S1 55 Inch Interactive Whiteboard?", "A": "The Vibe S1 55 Inch Interactive Whiteboard supports VESA 200X200.", "metadata": {"created_at": "2023-05-03 18:20:47"}}
{"Q": "What is the weight support required for a TV wall mount to hold the Vibe S1 55 Inch Interactive Whiteboard?", "A": "The TV wall mount should support at least 65 pounds for the Vibe S1 55 Inch Interactive Whiteboard.", "metadata": {"created_at": "2023-05-03 18:20:47"}}
{"Q": "What screw model is supported by the Vibe S1 55 Inch Interactive Whiteboard for mounting?", "A": "The Vibe S1 55 Inch Interactive Whiteboard supports the screw model M6, with a length that should be between 12-20mm depending on the mount.", "metadata": {"created_at": "2023-05-03 18:20:47"}}
{"Q": "How many holes or slots are there for wall mounting the Vibe S1 55 Inch Interactive Whiteboard?", "A": "There are four holes/slots at the back of the Vibe S1 55 Inch Interactive Whiteboard to accommodate the wall mount.", "metadata": {"created_at": "2023-05-03 18:20:47"}}
{"Q": "Can the Vibe Board 55\" be wall mounted?", "A": "Yes, all Vibe Boards can be wall mounted. The Vibe S1 Board 55\" requires a TV wall mount that supports VESA 200X200 and can support at least 65 pounds.", "metadata": {"created_at": "2023-05-03 19:41:55"}}
{"Q": "How to obtain a quote for Vibe products?", "A": "To build a quote, the sales team requires your billing/shipping address, contact name, contact number, and the name and number of items you would like to purchase. If you are sales tax exempt, you need to provide a sales tax-exempt form for tax adjustments.", "metadata": {"created_at": "2023-05-03 19:41:55"}}
{"Q": "How long is the quote valid for?", "A": "The quote is valid for a month.", "metadata": {"created_at": "2023-05-03 20:13:27"}}
{"Q": "What is the turnaround time from the time the order is placed?", "A": "It typically takes 1-2 days to process an order. Shipping time within the US is approximately 5-7 business days, depending on location.", "metadata": {"created_at": "2023-05-03 20:13:27"}}
{"Q": "How can I order the camera that goes with the Vibe board?", "A": "You can use the purchase link provided by the sales assistant to order the Vibe C1 AI Camera for your board.", "metadata": {"created_at": "2023-05-03 20:13:27"}}
{"Q": "Can the Vibe board help children with learning disorders?", "A": "Yes, the Vibe board is a suitable tool for visual, auditory, and kinesthetic learners and can also support children with ADHD, dyslexia, and hearing or vision problems.", "metadata": {"created_at": "2023-05-03 20:16:39"}}
{"Q": "What sizes do Vibe interactive whiteboards come in?", "A": "Vibe offers a 55 Inch and a 75 Inch Interactive Whiteboard.", "metadata": {"created_at": "2023-05-03 20:16:39"}}
{"Q": "Does the 55\" Vibe S1 Board come with any accessories?", "A": "Yes, the 55” Vibe S1 Board comes with a stylus, power cord, and a quick start guide.", "metadata": {"created_at": "2023-05-03 20:16:39"}}
{"Q": "Is there a free software option available to try before purchasing the Vibe board?", "A": "Yes, there is a free whiteboarding software available via the Vibe web app.", "metadata": {"created_at": "2023-05-03 20:16:39"}}
{"Q": "Are there any resources available to understand how to use the Vibe board for teaching?", "A": "Yes, there is a 20-minute demo called \"Teaching with Vibe\", case studies from educators, as well as Education blogs available as resources.", "metadata": {"created_at": "2023-05-03 20:16:39"}}
{"Q": "Can I return the Vibe board if it doesn't meet my needs?", "A": "Yes, there is a 30-day return policy where you can return the board within 30 days of delivery, only covering the cost of shipping back to the warehouse.", "metadata": {"created_at": "2023-05-03 20:16:39"}}
{"Q": "How do I initiate a payment after starting a free trial with Vibe?", "A": "Payments can be made using a card directly on the Vibe website.", "metadata": {"created_at": "2023-05-03 20:16:39"}}
{"Q": "Do you offer discounts for non profits?", "A": "We do not have a special nonprofit pricing or discount. Our pricing is competitive and includes free shipping within the US. For purchases of 3 or more units, a volume discount can be offered.", "metadata": {"created_at": "2023-05-03 20:45:31"}}
{"Q": "Can I get a discount on my first purchase from Vibe?", "A": "As a new visitor to the Vibe website, you might encounter a pop-up for the WELCOME100 offer, which gives you a $100 discount on your purchase after signing up with an email address.", "metadata": {"created_at": "2023-05-03 20:45:31"}}
{"Q": "Does Vibe help with removing taxes for sales tax exempt customers?", "A": "Yes, Vibe can help with removing the taxes from your purchase if you are sales tax exempt.", "metadata": {"created_at": "2023-05-03 20:45:31"}}
{"Q": "How can I adjust the volume on the Vibe Interactive Whiteboard without a remote?", "A": "To adjust the volume on the Vibe Interactive Whiteboard without a remote, there should be manual controls on the board itself. Specific instructions can be provided once the model is confirmed.", "metadata": {"created_at": "2023-05-04 13:50:29"}}
{"Q": "What should I do if my Vibe Pen is not working on the Canvas setting?", "A": "You may need to charge the stylus by connecting it to the debug port on the board via USB-C cable. If that does not resolve the issue, please reach out to our support team at support@vibe.us or submit a support ticket for assistance.", "metadata": {"created_at": "2023-05-04 14:29:46"}}
{"Q": "Does the Vibe Pen come with a charger?", "A": "The pen does not come with a charger, but it can be charged using a typical USB-C cable connected to the back of the stylus.", "metadata": {"created_at": "2023-05-04 14:29:46"}}
{"Q": "What is the estimated delivery time for the Vibe S1 75 Inch Interactive Whiteboard to Carrollton, GA?", "A": "The estimated delivery time within the US is approximately 5-7 business days, depending on the location.", "metadata": {"created_at": "2023-05-04 14:41:05"}}
{"Q": "Is there an expedited shipping option for the Vibe S1 75 Inch Interactive Whiteboard?", "A": "Expedited shipping is not available online, but the logistics team can be consulted for possible options and associated costs.", "metadata": {"created_at": "2023-05-04 14:41:05"}}
{"Q": "What is the cost for rush shipping to ensure delivery by 5/10 to Carrollton, GA?", "A": "The cost for rush shipping to ensure delivery by 5/10 to Carrollton, GA is $1488.66.", "metadata": {"created_at": "2023-05-04 14:41:05"}}
{"Q": "How can I make a tax-exempt purchase for a Vibe board?", "A": "To make a tax-exempt purchase, you will need to provide your billing/shipping address, contact name, contact number, name and number of items you wish to purchase, and a copy of your sales tax-exempt form.", "metadata": {"created_at": "2023-05-04 16:34:22"}}
{"Q": "What do I need to provide to create a quote or purchase link?", "A": "You need to provide your billing/shipping address, contact name, contact number, the name and number of items you wish to purchase, and a copy of your sales tax-exempt form.", "metadata": {"created_at": "2023-05-04 16:34:22"}}
{"Q": "Can I get a custom purchase link to complete an order without taxes for a Vibe board?", "A": "Yes, you can receive a custom purchase link to complete your order without taxes once you provide all the necessary information and documentation for tax-exempt purchasing.", "metadata": {"created_at": "2023-05-04 16:34:22"}}
{"Q": "What are the included components with the Vibe S1 55\" Interactive Whiteboard?", "A": "The Vibe Board S1 55\" comes with 1 stylus, power cord, and a quick start guide.", "metadata": {"created_at": "2023-05-04 17:56:22"}}
{"Q": "What is the cost of the Vibe S1 75\" Interactive Digital Whiteboard?", "A": "The Vibe S1 75\" Interactive Digital Whiteboard costs $6,999 USD.", "metadata": {"created_at": "2023-05-04 17:56:22"}}
{"Q": "What accessories come with the Vibe S1 75\" Whiteboard?", "A": "The Vibe 75\" board package includes 2 styluses, a wall mount, a remote controller, an HDMI cord & USB cable, a power cord, and a quick start guide.", "metadata": {"created_at": "2023-05-04 17:56:22"}}
{"Q": "How much does the stand for the Vibe board cost?", "A": "The stand for the Vibe board costs $899 USD.", "metadata": {"created_at": "2023-05-04 17:56:22"}}
{"Q": "Is there a discount available for purchasing multiple Vibe boards?", "A": "Yes, discounts may be offered for purchasing multiple Vibe boards.", "metadata": {"created_at": "2023-05-04 17:56:22"}}
{"Q": "How can you become an affiliate of Vibe products?", "A": "You can apply to become an affiliate by filling out a form to be evaluated for the influencer program, and someone from the marketing team will be in contact.", "metadata": {"created_at": "2023-05-04 17:56:22"}}
{"Q": "Is there a discount code available for purchasing the Vibe S1 on your website?", "A": "Yes, you can use the code WELCOME100 on our Vibe website to avail of a $100 discount.", "metadata": {"created_at": "2023-05-04 20:57:57"}}
{"Q": "Can I apply the discount code WELCOME100 when checking out on the Vibe website?", "A": "That is correct. You can enter the WELCOME100 code in the box provided during checkout on our Vibe website.", "metadata": {"created_at": "2023-05-04 20:57:57"}}
{"Q": "Should the WELCOME100 code be entered in any specific format?", "A": "The code should be entered in all caps as WELCOME100.", "metadata": {"created_at": "2023-05-04 20:57:57"}}
{"Q": "What are the options if a Vibe board has screen issues right outside the warranty period?", "A": "Our support team will advise on the next steps once a support ticket is created and they have been contacted regarding the issue.", "metadata": {"created_at": "2023-05-05 13:49:08"}}
{"Q": "How can I order more vibe pens for my Vibe board?", "A": "You can select the styluses for your board from our accessories list on the Shop Vibe Interactive Smart Whiteboards page on our website. Please scroll midway down the page and you will see the accessories. Click on the arrow on the right side of the page, then select \"Add to Cart\" for the appropriate board size.", "metadata": {"created_at": "2023-05-05 18:30:35"}}
{"Q": "Are Vibe orders sales tax-exempt?", "A": "If you are sales tax-exempt, we can create a purchase link for you to complete your order without taxes. You will need to provide a copy of your sales tax exemption form or certificate.", "metadata": {"created_at": "2023-05-05 18:30:35"}}
{"Q": "How can I find the accessories list on the Vibe website?", "A": "To find the accessories list on the Vibe website, scroll midway down the Shop Vibe Interactive Smart Whiteboards page. To see the stylus, click on the arrow on the right side of the page. Then, you can proceed to add it to your cart for the 75\" board size.", "metadata": {"created_at": "2023-05-05 18:30:35"}}
{"Q": "Does the S1 support the Company Cam app?", "A": "The Vibe S1 boards are based on Chromium OS and support many third-party apps, including web-based apps and those from the Google Play Store. The Company Cam app, if web-based or available on Google Play, is likely to work on Vibe boards.", "metadata": {"created_at": "2023-05-05 21:38:36"}}
{"Q": "Can I schedule a demo to see how a particular app works on a Vibe board?", "A": "Yes, you can schedule a demo with a Vibe team member to explore your use case, get a walk-through of the Vibe board, and see how specific apps work.", "metadata": {"created_at": "2023-05-05 21:38:36"}}
{"Q": "What is Vibe's return policy?", "A": "Vibe offers a 30-day return policy. If you are not satisfied with your purchase, you can return the device within 30 days of the delivery date, covering only the cost of shipping back to the warehouse.", "metadata": {"created_at": "2023-05-05 21:38:36"}}
{"Q": "Why is the price in my shopping cart incorrect?", "A": "The price might seem incorrect due to discounts that have already been applied to individual items. The original prices of the stand and the camera are higher, and the $300 discount is off their original price, not the already discounted price.", "metadata": {"created_at": "2023-05-05 22:45:20"}}
{"Q": "How can I apply an additional discount on my Vibe order?", "A": "You can use the discount code WELCOME100 at checkout to avail of a $100 discount.", "metadata": {"created_at": "2023-05-05 22:45:20"}}
{"Q": "Will I receive tracking details for my Vibe order?", "A": "Yes, you will receive tracking details via email as soon as they become available.", "metadata": {"created_at": "2023-05-05 22:45:20"}}
{"Q": "Can I project an excel spreadsheet onto the Vibe board and interact with it directly on the board?", "A": "Yes, you can connect and share an excel spreadsheet to the board and move certain aspects of it by touching the board if you use the USB-C Video Monitor Cable from a computer USB-C port to the #4-Touch USB-C port on the 55\" Vibe Board.", "metadata": {"created_at": "2023-05-08 14:15:20"}}
{"Q": "How do I pair my Vibe pen with the Vibe board to use it as a clicker?", "A": "You can pair the Vibe pen with the Vibe board by following the instructions in the Vibe board S1 stylus user guide, which can be found at the provided link.", "metadata": {"created_at": "2023-05-08 16:46:20"}}
{"Q": "How do I troubleshoot a Vibe board's Bluetooth that won't turn on?", "A": "If the Bluetooth toggle is unresponsive on your Vibe board, try restarting the board. If the issue persists, please reach out to the support team for further assistance.", "metadata": {"created_at": "2023-05-08 16:46:20"}}
{"Q": "What sizes of Vibe boards are available?", "A": "We have two sizes available: 55\" and 75\".", "metadata": {"created_at": "2023-05-08 16:58:08"}}
{"Q": "What items are included with the Vibe S1 55 Inch Interactive Whiteboard?", "A": "It comes with one active stylus, power cord, and user manual.", "metadata": {"created_at": "2023-05-08 16:58:08"}}
{"Q": "Are there optional accessories available for the Vibe S1 55 Inch Interactive Whiteboard?", "A": "Yes, a portable stand and a camera are optional accessories.", "metadata": {"created_at": "2023-05-08 16:58:08"}}
{"Q": "Is the Vibe software included with the board?", "A": "Yes, the Vibe software comes included with the board at no additional cost at this time.", "metadata": {"created_at": "2023-05-08 16:58:08"}}
{"Q": "What are the delivery options and are there any fees associated with them?", "A": "All orders are curbside delivery which is free, unless specified otherwise for services such as inside delivery or lift gate, which incur fees.", "metadata": {"created_at": "2023-05-08 16:58:08"}}
{"Q": "Are quotes valid for a specific time period?", "A": "Yes, quotes are normally valid for a month.", "metadata": {"created_at": "2023-05-08 16:58:08"}}
{"Q": "What kind of discounts does Vibe offer on bulk purchases?", "A": "For bulk purchases, a 5% bulk discount is applied.", "metadata": {"created_at": "2023-05-08 16:58:08"}}
{"Q": "What are the payment methods accepted by Vibe?", "A": "Payment can be made via a card, purchase orders with net 30 terms, check, ACH deposit, or wire transfer.", "metadata": {"created_at": "2023-05-08 16:58:08"}}
{"Q": "How can I track my Vibe board delivery?", "A": "To track your Vibe board delivery, use the tracking information provided at the time of shipment. If you're having issues or can't find your tracking details, please contact our customer support for assistance.", "metadata": {"created_at": "2023-05-08 17:30:23"}}
{"Q": "What should I do if there are delivery issues at my building for my Vibe board?", "A": "If there are known delivery issues at your building, please inform our customer support team. They can assist with special delivery instructions or coordinate with the delivery service to ensure your Vibe board arrives safely.", "metadata": {"created_at": "2023-05-08 17:30:23"}}
{"Q": "Does the Vibe S1 55\" Interactive Whiteboard come with a wall mount?", "A": "The S1 55\" board does not come included with a wall mount, but it has four slots in the middle of the board for mounting which are covered with small plastic studs that need to be removed to see the holes.", "metadata": {"created_at": "2023-05-08 17:36:29"}}
{"Q": "How can I find information on mounting the Vibe S1 55\" Interactive Whiteboard?", "A": "There's an article available at https://vibe.how/en/articles/7007320-wall-mounts-for-vibe-board-s1-55 with a recommended wall mount and an image to assist with the mounting process.", "metadata": {"created_at": "2023-05-08 17:36:29"}}
{"Q": "What are the hours for Vibe's customer service?", "A": "The US Support Team is available Monday - Friday, 8:30am - 5:00pm Pacific Time. The offices are closed for national U.S. holidays.", "metadata": {"created_at": "2023-05-08 19:53:46"}}
{"Q": "How can I contact Vibe's customer service?", "A": "You can contact Vibe's customer service through chat, email (support@vibe.us), or schedule a Zoom meeting for a more interactive session.", "metadata": {"created_at": "2023-05-08 19:53:46"}}
{"Q": "Is there a warranty included with a Vibe purchase?", "A": "Yes, a standard 1-year manufacturer warranty is included with a Vibe purchase, with an option to purchase an extended warranty during checkout on the website.", "metadata": {"created_at": "2023-05-08 19:53:46"}}
{"Q": "How soon does the Global Support Team respond to emails?", "A": "The Global Support Team aims to respond within 1 business day, if not sooner.", "metadata": {"created_at": "2023-05-08 19:53:46"}}
{"Q": "Where can I find support articles and tutorials for Vibe products?", "A": "Support articles and tutorials can be found in the Help Center and the Vibe Product Videos section on the website.", "metadata": {"created_at": "2023-05-08 19:53:46"}}
{"Q": "Can I modify an order to add an additional item after purchase?", "A": "No, you cannot modify an order to add items after the purchase has been made, but the order can be cancelled so that you can place a new order including the additional item.", "metadata": {"created_at": "2023-05-08 21:08:48"}}
{"Q": "If I can't modify my order, can it be cancelled?", "A": "Yes, if you cannot modify your order, it can be cancelled and you can place a new order that includes everything you need.", "metadata": {"created_at": "2023-05-08 21:08:48"}}
{"Q": "Do you offer dealer pricing for resale?", "A": "Yes, we do offer dealer pricing for resale. Interested parties should visit the Vibe Reseller Program to fill in the Vibe Reseller Partner form and provide the necessary documents to receive an official reseller quote.", "metadata": {"created_at": "2023-05-08 22:07:09"}}
{"Q": "What documents are required to become a Vibe reseller?", "A": "To become a Vibe reseller, you need to provide your resale certificate, W-9, and tax forms via email after completing the Vibe Reseller Partner form.", "metadata": {"created_at": "2023-05-08 22:07:09"}}
{"Q": "Can I get a quote for a stand for my Vibe S1 55 Inch Interactive Whiteboard after purchase?", "A": "Yes, the sales team can provide a quote for the stand for the Vibe S1 55 Inch Interactive Whiteboard, which will be sent via email.", "metadata": {"created_at": "2023-05-09 13:36:46"}}
{"Q": "How will I receive the quote for the Vibe S1 stand?", "A": "The quote for the Vibe S1 stand will be sent to you via email.", "metadata": {"created_at": "2023-05-09 13:36:46"}}
{"Q": "How can I pull up the on-screen keyboard on the Vibe S1 55 Inch Interactive Whiteboard?", "A": "Go to the Settings menu, click on Accessibility, scroll to the Keyboard and Text Input section, and there should be a toggle switch to enable the on-screen keyboard.", "metadata": {"created_at": "2023-05-09 15:46:38"}}
{"Q": "How can I switch from moving mode back to writing after doing a quick tap on the whiteboard?", "A": "Ensure that you have the writing tool selected rather than the selection option. Essentially, select the Text option on the toolbar.", "metadata": {"created_at": "2023-05-09 15:46:38"}}
{"Q": "Can I install any app from the Google Play Store on the Vibe S1 55 Inch Interactive Whiteboard?", "A": "Yes, you can install apps once you enable the Google Play Store option on your board.", "metadata": {"created_at": "2023-05-09 15:46:38"}}
{"Q": "Can I test the Vibe in a retail environment before buying?", "A": "Currently, there is no physical location to test out the Vibe Board, but you can schedule an online demo.", "metadata": {"created_at": "2023-05-09 17:46:44"}}
{"Q": "Are there plans for Vibe products to be displayed in retail locations like Best Buy or Staples?", "A": "As of now, Vibe products are not available in stores, but customer feedback on this matter will be considered for future plans.", "metadata": {"created_at": "2023-05-09 17:46:44"}}
{"Q": "What is the estimated shipping time to Maryland for an order placed today?", "A": "Shipping time to Maryland is approximately 5-7 business days after a 1-2 day order processing period.", "metadata": {"created_at": "2023-05-09 17:46:44"}}
{"Q": "Is there a hard shell case made for the Vibe board for shipping purposes?", "A": "Vibe does not have a suggested shipping container, but a third-party option can be considered, or the original box with Styrofoam can be used to keep the board secure during transport.", "metadata": {"created_at": "2023-05-09 17:50:38"}}
{"Q": "Can I use a second camera with the Vibe Board Pro 75\"?", "A": "Yes, Vibe Board Pro 75″ is compatible with most USB-connected cameras and microphones.", "metadata": {"created_at": "2023-05-09 18:47:35"}}
{"Q": "Any suggestions on a second USB camera that has full rotation?", "A": "The article \"Which cameras and microphones work with the Vibe Board Pro 75″\" in the Vibe Help Center has some camera recommendations that work with the 75\" board.", "metadata": {"created_at": "2023-05-09 18:47:35"}}
{"Q": "Can I use an ethernet-based camera with the Vibe boards?", "A": "The Vibe boards support USB-connected cameras, and it's not confirmed if an ethernet-based camera will work. The recommended cameras are those USB-connected options that have been tested and proven to work with the Vibe Pro.", "metadata": {"created_at": "2023-05-09 18:47:35"}}
{"Q": "Do the Vibe boards allow for multiple user profiles?", "A": "Yes, both the S1 55\" and 75\" Vibe boards support multiple user profiles and individual logins.", "metadata": {"created_at": "2023-05-09 19:34:48"}}
{"Q": "Can users create their own accounts on the Vibe board?", "A": "Yes, users can create their own Vibe accounts with their email address either at app.vibe.us or directly from the board.", "metadata": {"created_at": "2023-05-09 19:34:48"}}
{"Q": "Is there a PIN setup option for the Vibe board?", "A": "Yes, users can set up a PIN to quickly log into the board.", "metadata": {"created_at": "2023-05-09 19:34:48"}}
{"Q": "Do the Vibe boards integrate with Active Directory for sign-on?", "A": "The Vibe boards support single sign-on. More details can be found in the support article related to SAML single sign-on on Vibe's website.", "metadata": {"created_at": "2023-05-09 19:34:48"}}
{"Q": "Does the Vibe S1 55\" board work with a stylus?", "A": "Yes, the Vibe S1 55\" board includes a stylus and supports digital whiteboarding with the Vibe Canvas app.", "metadata": {"created_at": "2023-05-09 19:34:48"}}
{"Q": "Is there a management software for Vibe boards to control settings and push out announcements?", "A": "Yes, there is a Vibe admin portal to control settings and push out announcements.", "metadata": {"created_at": "2023-05-10 14:58:01"}}
{"Q": "Does Vibe offer free trials for their boards?", "A": "Vibe does not offer a free trial, but they do have a 30-day return policy where customers can return the product if they are not satisfied and only need to cover the cost of shipping back to the warehouse.", "metadata": {"created_at": "2023-05-10 14:58:01"}}
{"Q": "Are virtual product demos available for Vibe boards?", "A": "Yes, Vibe offers virtual product demos, and interested customers can schedule a session with a specialist.", "metadata": {"created_at": "2023-05-10 14:58:01"}}
{"Q": "Is Google Meet supported on Vibe boards?", "A": "Google Meet should work on Vibe boards, but if you encounter issues, our support team can assist you through a support ticket.", "metadata": {"created_at": "2023-05-10 15:29:51"}}
{"Q": "How do I order the products once I get the PO number?", "A": "If you would like to pay with a check, wire transfer or domestic ACH, please send us a purchase order matching the quote below. Purchase orders will be processed in 1-2 business days.", "metadata": {"created_at": "2023-05-10 15:33:30"}}
{"Q": "How do I send the PO?", "A": "Please send a copy of the PO to sales@vibe.us for processing.", "metadata": {"created_at": "2023-05-10 15:33:30"}}
{"Q": "Where should I send the check if paying by check?", "A": "Please send the check to the remit to address on the quote document, which is PO Box 737062 Dallas TX 75373.", "metadata": {"created_at": "2023-05-10 15:33:30"}}
{"Q": "Is the Vibe S1 75 Inch Interactive Whiteboard UL rated?", "A": "The UL rating of the Vibe S1 75 Inch Interactive Whiteboard is currently being checked with our hardware team. We will follow up with the information via email as soon as it is confirmed.", "metadata": {"created_at": "2023-05-10 16:53:40"}}
{"Q": "Do the Vibe interactive whiteboards come with a built-in camera?", "A": "No, the boards do not have built-in cameras.", "metadata": {"created_at": "2023-05-10 19:07:17"}}
{"Q": "Is the add-on camera just better or is it the only camera option for the Vibe boards?", "A": "The add-on camera is the only camera option for the Vibe boards as they do not come with built-in cameras.", "metadata": {"created_at": "2023-05-10 19:07:17"}}
{"Q": "Will the Vibe board be on sale anytime soon?", "A": "There is no current sale, but any upcoming sales or promotions will be advertised, and customers can stay tuned to marketing emails for information.", "metadata": {"created_at": "2023-05-10 19:07:17"}}
{"Q": "How can I get a discount code for my purchase on the Vibe website?", "A": "New visitors might get a pop-up on the Vibe website to sign up for the WELCOME100 offer. After entering an email address, they will receive a $100 offer code, WELCOME100, which can be used towards their purchase.", "metadata": {"created_at": "2023-05-10 19:07:17"}}
{"Q": "Is there free shipping for Vibe products?", "A": "Yes, Vibe offers free shipping within the Continental US.", "metadata": {"created_at": "2023-05-10 19:07:17"}}
{"Q": "What kind of pens are required to write on the Vibe interactive whiteboard?", "A": "The board comes with one active stylus, and additional active styluses or passive styluses can be purchased from the Vibe website on their accessories page.", "metadata": {"created_at": "2023-05-10 19:07:17"}}
{"Q": "What's the difference between passive and active pens?", "A": "The active stylus has special buttons for eraser and page up and down and has to be paired with the board, while the passive stylus is just for writing and making selections on the board and has no special features.", "metadata": {"created_at": "2023-05-10 19:26:19"}}
{"Q": "Can multiple users use the interactive whiteboard at the same time?", "A": "Yes, the S1 55\" Vibe board can facilitate up to 4 users with its 10 simultaneous touch points, while the 75\" board supports more with 20 simultaneous touch points.", "metadata": {"created_at": "2023-05-11 14:25:29"}}
{"Q": "Does the Vibe Board have its own computer system?", "A": "Yes, the Vibe Board is a standalone device with its own i5 processor and can operate without being connected to a computer.", "metadata": {"created_at": "2023-05-11 15:08:07"}}
{"Q": "Can a computer be connected to the Vibe Board?", "A": "Yes, a computer can be connected wirelessly or via HDMI to screencast to the Vibe Board.", "metadata": {"created_at": "2023-05-11 15:08:07"}}
{"Q": "Are there any apps pre-installed on the Vibe Board?", "A": "The Vibe Board comes with the Vibe Canvas app and the Chromium internet browser pre-installed.", "metadata": {"created_at": "2023-05-11 15:08:07"}}
{"Q": "Can my organization manage Vibe Smartboards via Jamf or Microsoft asset management?", "A": "Vibe Smartboards do not support Jamf or Microsoft asset management. The Vibe admin portal is recommended for managing these devices.", "metadata": {"created_at": "2023-05-11 15:29:49"}}
{"Q": "Does the Vibe S1 55 Inch Interactive Whiteboard come with a wall mount?", "A": "Most TV wall mounts that support VESA 200X200 and can support at least 65 pounds will work for the Vibe S1 55 Inch Interactive Whiteboard.", "metadata": {"created_at": "2023-05-11 16:15:13"}}
{"Q": "Does the Vibe S1 75 Inch Interactive Whiteboard come with a wall mount?", "A": "Yes, the Vibe S1 75\" Pro Board comes with a complimentary wall mount included when purchased.", "metadata": {"created_at": "2023-05-11 16:15:13"}}
{"Q": "What is the cost of the stand for the Vibe S1 75 Inch Interactive Whiteboard?", "A": "The stand for the Vibe S1 75 Inch Interactive Whiteboard costs $899 USD.", "metadata": {"created_at": "2023-05-11 16:15:13"}}
{"Q": "How many devices can I stream at a time to the Vibe boards?", "A": "You can cast at least two devices to the Vibe boards at the same time.", "metadata": {"created_at": "2023-05-11 16:15:13"}}
{"Q": "What are the unique features of Vibe boards in comparison to competitors like OneScreen?", "A": "The Vibe boards do not have any associated costs with subscriptions, support, training, they come with free shipping to curbside, and use a powerful I5 quad-core 8th gen processor. Vibe also has proprietary whiteboarding software called \"Canvas\". Additional benefits include no need to attach a computer for full use and no monthly/annual subscription fees unlike some competitors.", "metadata": {"created_at": "2023-05-11 16:15:13"}}
{"Q": "Is it easy to set up the Vibe boards once received?", "A": "Yes, the Vibe board is plug-and-play, and setup depends on whether you choose to use it on a stand or mounted on a wall.", "metadata": {"created_at": "2023-05-11 16:15:13"}}
{"Q": "Do Vibe boards support Microsoft apps?", "A": "Yes, Microsoft apps are supported on Vibe boards.", "metadata": {"created_at": "2023-05-11 16:15:13"}}
{"Q": "Is Affirm financing available to customers outside of the US?", "A": "No, Affirm is only available to customers within the US.", "metadata": {"created_at": "2023-05-11 16:22:40"}}
{"Q": "Can I pay for Vibe products in monthly installments from outside of the US?", "A": "While Affirm offers monthly installment options within the US, alternative payment methods such as check, wire transfer, or ACH deposit do not offer installment plans and require payment in full.", "metadata": {"created_at": "2023-05-11 16:22:40"}}
{"Q": "What recommendations do you have for a tutoring agency looking to facilitate hybrid classes interactively?", "A": "Both the Vibe S1 55 Inch and the Vibe S1 75 Inch Interactive Whiteboards are suitable for teaching and can be used in various educational settings, including hybrid classes. The choice will depend on the size of the classroom.", "metadata": {"created_at": "2023-05-11 16:22:40"}}
{"Q": "What sizes of Vibe boards are available?", "A": "We currently have two sizes available: 55\" and 75\".", "metadata": {"created_at": "2023-05-11 16:46:46"}}
{"Q": "What is the price for the S1 55\" Vibe board?", "A": "The S1 55\" Vibe board starts at $3,299 USD.", "metadata": {"created_at": "2023-05-11 16:46:46"}}
{"Q": "What is included with the S1 55\" Vibe board purchase?", "A": "It comes included with one stylus, power cord, and user manual.", "metadata": {"created_at": "2023-05-11 16:46:46"}}
{"Q": "Is there a bundle available for the S1 55\" Vibe board?", "A": "Yes, the bundle includes the 55\" board, a portable stand, and camera, totaling $3,799 USD.", "metadata": {"created_at": "2023-05-11 16:46:46"}}
{"Q": "Is installation provided for Vibe boards?", "A": "No, Vibe does not provide installation. The Vibe board is plug-and-play and can be mounted like a TV.", "metadata": {"created_at": "2023-05-11 16:46:46"}}
{"Q": "Can I get assistance with setup after purchasing a Vibe board?", "A": "Yes, you can contact the support team at support@vibe.us for setup instructions.", "metadata": {"created_at": "2023-05-11 16:46:46"}}
{"Q": "Is there any offer available for new customers purchasing a Vibe board?", "A": "New visitors to the website may find a pop-up to sign up for the WELCOME100 offer, which gives a $100 discount towards the purchase of a Vibe board.", "metadata": {"created_at": "2023-05-11 16:46:46"}}
{"Q": "How much does the bundle including the 55\" board, stand, and camera cost?", "A": "The bundle cost is $3,299 USD.", "metadata": {"created_at": "2023-05-11 16:46:46"}}
{"Q": "How long does it take to process an order for a Vibe Board S1 55 inch?", "A": "It typically takes 1-2 days to process an order.", "metadata": {"created_at": "2023-05-11 17:07:37"}}
{"Q": "What is the shipping time within the US for the Vibe Board S1 55 inch?", "A": "Shipping time within the US is approximately 5-7 business days, depending on your location.", "metadata": {"created_at": "2023-05-11 17:07:37"}}
{"Q": "Does Vibe offer expedited shipping for the S1 55 inch board?", "A": "Vibe does not have expedited shipping options set up online, but they can check with their Logistics team for possible expedited shipping and associated costs if a customer is interested.", "metadata": {"created_at": "2023-05-11 17:07:37"}}
{"Q": "What is the return policy for Vibe products?", "A": "Vibe offers a 30 days return policy. If not satisfied with the device, it can be returned within 30 days of the delivery date, and the customer would need to cover the cost of shipping back to the warehouse.", "metadata": {"created_at": "2023-05-11 17:07:37"}}
{"Q": "What specifications are required for a wall mount to be compatible with the Vibe Board S1 55\"?", "A": "The mount must support VESA 200X200, be able to support at least 65 pounds, and use an M6 screw model with a length between 12-20mm.", "metadata": {"created_at": "2023-05-11 17:07:37"}}
{"Q": "Are there any recommended wall mounts for the Vibe Board S1 55\"?", "A": "Yes, the Kanto PDX650 Full Motion Articulating TV Wall Mount is recommended.", "metadata": {"created_at": "2023-05-11 17:07:37"}}
{"Q": "What type of keyboard and mouse can be used with Vibe boards?", "A": "Any keyboard and mouse that connect via USB-C or with an adapter from USB-A to USB-C can be used. Some recommended options are Dell Wireless Pro Keyboard and Mouse, and Rii RKM709 2.4 Gigahertz Ultra-Slim Wireless Keyboard and Mouse Combo.", "metadata": {"created_at": "2023-05-11 17:07:37"}}
{"Q": "What can be done if a Vibe S1 interactive whiteboard does not connect properly to a school's website and drops the connection?", "A": "Our technical support team can assist with troubleshooting the connection issues to ensure the Vibe S1 interactive whiteboard functions properly. We can provide guidance to the IT personnel at the school to resolve any connectivity problems.", "metadata": {"created_at": "2023-05-11 17:48:01"}}
{"Q": "Can Vibe provide a custom purchase link for tax-exempt government purchases?", "A": "Yes, Vibe can provide a custom purchase link for tax-exempt government purchases once they receive the necessary information and sales tax-exempt form.", "metadata": {"created_at": "2023-05-11 18:00:00"}}
{"Q": "What information does Vibe need to process a tax-exempt purchase?", "A": "Vibe requires the billing/shipping address, contact name, contact number, number of items wished to be purchased, and a copy of the sales tax-exempt form for tax-exempt purchases.", "metadata": {"created_at": "2023-05-11 18:00:00"}}
{"Q": "What are the requirements for a wall mount for the S1 55\" Vibe board?", "A": "The wall mount must support VESA 200X200 and be able to support at least 65 pounds.", "metadata": {"created_at": "2023-05-11 18:13:34"}}
{"Q": "Do you offer any government discounts?", "A": "We do not have a government discount but offer bulk discounts for purchases of 3 or more boards.", "metadata": {"created_at": "2023-05-12 14:34:36"}}
{"Q": "Can I get any discount if I am ordering just one board?", "A": "You can use the WELCOME100 discount for $100 off your first order when you sign up on our website.", "metadata": {"created_at": "2023-05-12 14:34:36"}}
{"Q": "Can taxes be removed from my order?", "A": "Yes, we can remove the taxes from your order once you provide your sales tax-exempt certificate.", "metadata": {"created_at": "2023-05-12 14:34:36"}}
{"Q": "Do you offer free shipping?", "A": "We offer free shipping within the Continental US.", "metadata": {"created_at": "2023-05-12 14:34:36"}}
{"Q": "Can I access Vibe Board from multiple phones like mine and my drivers' phones?", "A": "Yes, you can access the Vibe Canvas whiteboarding feature from multiple devices including phones, tablets, computers, or additional Vibe Boards for collaboration, using our cloud-based software.", "metadata": {"created_at": "2023-05-12 15:27:30"}}
{"Q": "Is the mobile app for Vibe Canvas collaborative?", "A": "No, at this time, our mobile app is view-only and does not allow for collaboration.", "metadata": {"created_at": "2023-05-12 15:27:30"}}
{"Q": "What are the dimensions of the Vibe Stand for the S1 55 Inch Interactive Whiteboard?", "A": "The dimensions of the Vibe Stand for the S1 55\" can be found in the attachment provided by the salesperson, specifically at the bottom right of the page.", "metadata": {"created_at": "2023-05-12 16:25:14"}}
{"Q": "Can the Vibe S1 55 Inch Interactive Whiteboard be wall-mounted?", "A": "Yes, the Vibe S1 55 Inch Interactive Whiteboard can be wall-mounted.", "metadata": {"created_at": "2023-05-12 16:25:14"}}
{"Q": "Are third-party stands compatible with the Vibe S1 55 Inch Interactive Whiteboard?", "A": "Yes, third-party stands can be considered for use with the Vibe S1 55 Inch Interactive Whiteboard.", "metadata": {"created_at": "2023-05-12 16:25:14"}}
{"Q": "Is Microsoft Teams supported in Vibe boards?", "A": "Our product experts can provide a walk-through of how the Vibe board works, including its integration with Microsoft Teams during a scheduled demo.", "metadata": {"created_at": "2023-05-12 17:06:04"}}
{"Q": "What are the specifications of the Vibe board's speakers?", "A": "You can discuss the specifications, including those of the speakers, with one of our product experts during a demonstration.", "metadata": {"created_at": "2023-05-12 17:06:04"}}
{"Q": "Can Vibe boards be integrated on an enterprise level using MS Intune?", "A": "Our expert, Austin, during a scheduled product demonstration, will advise on the possibility of integrating Vibe boards with enterprise solutions such as MS Intune.", "metadata": {"created_at": "2023-05-12 17:06:04"}}
{"Q": "What is the cost of integrating Vibe boards in a Microsoft enterprise environment?", "A": "The cost specifics for setting up a Vibe board in a Microsoft enterprise environment can be discussed with our product expert during a demo.", "metadata": {"created_at": "2023-05-12 17:06:04"}}
{"Q": "Can Windows OS be installed natively on Vibe Boards?", "A": "Windows OS cannot be installed natively on our Vibe Boards as of now, but it is a feature that is being worked on for later in 2023.", "metadata": {"created_at": "2023-05-12 17:06:50"}}
{"Q": "If a Vibe Board with Chrome OS is purchased now, can it be converted to Windows once available?", "A": "Yes, a Vibe Board purchased with Chrome OS can later be converted to Windows OS when it becomes available.", "metadata": {"created_at": "2023-05-12 17:06:50"}}
{"Q": "Is it possible to convert the Vibe Board to Windows OS currently?", "A": "Conversion to Windows OS is possible as it is currently in the Beta phase.", "metadata": {"created_at": "2023-05-12 17:06:50"}}
{"Q": "What resources are available for teaching with Vibe?", "A": "We have a 20-minute demo, a 4 min product tour, case studies from kindergarten teachers and universities, and numerous educational blogs.", "metadata": {"created_at": "2023-05-12 20:54:20"}}
{"Q": "What sizes of Vibe Interactive Whiteboards are available?", "A": "We have two sizes available: 55\" and 75\".", "metadata": {"created_at": "2023-05-12 20:54:20"}}
{"Q": "Can I set up a virtual demo to see the Vibe board in action?", "A": "Yes, if you are interested, we can set up a virtual demo for you to see the board in action.", "metadata": {"created_at": "2023-05-12 20:54:20"}}
{"Q": "Is there any current promotion for Vibe boards?", "A": "Unfortunately, there is no promotion currently, but you can sign up for our newsletter to get notified about future sales.", "metadata": {"created_at": "2023-05-12 20:54:20"}}
{"Q": "Does Vibe provide international shipping?", "A": "Unfortunately, Vibe does not currently ship internationally to places like Vietnam or Asia, but they are working on global expansion and potential customers can join a waiting list.", "metadata": {"created_at": "2023-05-15 17:00:34"}}
{"Q": "Can the Vibe S1 55 Inch Interactive Whiteboard be connected to a wired LAN?", "A": "The Vibe S1 55 Inch Interactive Whiteboard does not have a native Ethernet port, but you can connect to a wired LAN using a USB-C to Ethernet converter plugged into port 1 or 3 of the board.", "metadata": {"created_at": "2023-05-15 17:00:34"}}
{"Q": "If someone used a dry erase marker on a Vibe interactive whiteboard by mistake, how can that be fixed?", "A": "The screen of the Vibe interactive whiteboard is made of 3 mm tempered glass with anti-glare, anti-fingerprint coating and doesn't have a screen protector. The company provides an article with tips for cleaning and taking care of the Vibe board, which includes how to clean the screen if a marker is used by mistake.", "metadata": {"created_at": "2023-05-15 18:31:37"}}
{"Q": "Is there a glass on the front of the Vibe interactive whiteboards?", "A": "Yes, the front of the Vibe interactive whiteboards is made of 3 mm tempered glass with anti-glare, anti-fingerprint coating.", "metadata": {"created_at": "2023-05-15 18:31:37"}}
{"Q": "Can you order replacement styluses for the Vibe interactive whiteboard?", "A": "Yes, you can order additional styluses on the Vibe website, although physical damages to the stylus are not covered under the manufacturer's warranty.", "metadata": {"created_at": "2023-05-15 18:31:37"}}
{"Q": "Can Vibe interactive whiteboards be connected to a domain?", "A": "Yes, Vibe interactive whiteboards can be connected to a domain.", "metadata": {"created_at": "2023-05-15 18:31:37"}}
{"Q": "What should I do if my company credit card is not going through for a Vibe S1 purchase?", "A": "You can check with your bank or financial institution to ensure the authorizations are removed so you can proceed with the purchase. Additionally, the sales assistant can create a payment link for you, and if you still encounter issues, you might need to try again later or use a different browser or card.", "metadata": {"created_at": "2023-05-15 19:42:17"}}
{"Q": "Can I purchase the Vibe S1 on Amazon if I'm having issues buying it through your website?", "A": "Yes, the Vibe S1 is available for purchase on Amazon.", "metadata": {"created_at": "2023-05-15 19:42:17"}}
{"Q": "How much does the Vibe S1 board and stand cost on Amazon?", "A": "The Vibe S1 board and the stand would cost $3,579 before taxes on Amazon.", "metadata": {"created_at": "2023-05-15 19:42:17"}}
{"Q": "What options do I have if my payment is getting declined for technical reasons?", "A": "If your payment is declined for technical reasons, it's suggested to try connecting to another network, try purchasing from an incognito browser, or attempt the purchase again later. Additionally, you can try using a different credit card or browser.", "metadata": {"created_at": "2023-05-15 19:42:17"}}
{"Q": "How can I proceed if the Vibe S1 purchase isn't working on my current network or browser?", "A": "You can switch to another network or try purchasing from an incognito browser to see if it resolves the issue.", "metadata": {"created_at": "2023-05-15 19:42:17"}}
{"Q": "Does the Vibe S1 55\" interactive whiteboard come with a wall mount?", "A": "No, the S1 55\" board doesn't come included with a wall mount. You would need to purchase one separately.", "metadata": {"created_at": "2023-05-15 21:04:37"}}
{"Q": "What should I look for in a wall mount for the Vibe S1 55\" interactive whiteboard?", "A": "Most TV wall mounts would work for the S1 Board 55\" as long as it supports VESA 200X200 and can support at least 51.6 pounds. The supported screw model is M6, and the length should be between 12-20mm.", "metadata": {"created_at": "2023-05-15 21:04:37"}}
{"Q": "If I order a Vibe stand today, when can I expect to receive it?", "A": "It typically takes 1-2 days to process an order, and then shipping within the US is approximately 5-7 business days.", "metadata": {"created_at": "2023-05-15 21:06:42"}}
{"Q": "Are Vibe boards compatible with third-party stands?", "A": "The conversation does not specify compatibility with third-party stands, but Armando already owns a Vibe board and is looking to purchase a Vibe stand.", "metadata": {"created_at": "2023-05-15 21:06:42"}}
{"Q": "Can I receive my order by expedited shipping?", "A": "Vibe is not set up for expedited shipping online, but depending on your location and circumstances, the Logistics team might be able to arrange something.", "metadata": {"created_at": "2023-05-15 21:06:42"}}
{"Q": "Is there a separate cost for ordering a stand without the Vibe board?", "A": "The cost for a standalone stand is $500 but there's a bundle cost of $300 available. Shipping for the standalone stand would be an additional $80.", "metadata": {"created_at": "2023-05-15 21:06:42"}}
{"Q": "Is the price the same if I order through Amazon?", "A": "Yes, the cost for the stand is the same on Amazon. However, for tax-exempt orders, it is suggested to order on the Vibe website.", "metadata": {"created_at": "2023-05-15 21:06:42"}}
{"Q": "How do I process a tax-exempt purchase on the Vibe website?", "A": "You would need to share your shipping address and tax exemption form to create a custom purchase link.", "metadata": {"created_at": "2023-05-15 21:06:42"}}
{"Q": "How will I know when my order has shipped?", "A": "You will receive an email confirmation with tracking details once the order is shipped.", "metadata": {"created_at": "2023-05-15 21:06:42"}}
{"Q": "Is expedited shipping available even though it's not offered online?", "A": "Expedited shipping isn't available online, but the sales assistant can inquire with the Logistics team for possibilities.", "metadata": {"created_at": "2023-05-15 21:06:42"}}
{"Q": "What should I do if the website cart is not working?", "A": "If you're having issues with the website cart, a sales representative can provide a custom purchase link to complete your order after collecting the necessary information like billing/shipping address, contact name, contact number, items to purchase, and sales tax-exempt form if applicable.", "metadata": {"created_at": "2023-05-15 22:59:17"}}
{"Q": "Can I get a discount if I am an existing customer?", "A": "Yes, as an existing customer, you may be eligible for a special exclusive customer discount on your purchase.", "metadata": {"created_at": "2023-05-15 22:59:17"}}
{"Q": "What should I do if I receive a \"critically low disc space\" alert after adding only a handful of Canvases?", "A": "You should contact technical support for assistance, and they will create a support ticket for you to resolve the issue.", "metadata": {"created_at": "2023-05-16 14:04:24"}}
{"Q": "How will the support team contact me after creating a support ticket?", "A": "The support team will reach out to you through email.", "metadata": {"created_at": "2023-05-16 14:04:24"}}
{"Q": "What is the total height of the Vibe S1 on the stand?", "A": "The total height of the Vibe S1 on the stand is 71 inches.", "metadata": {"created_at": "2023-05-16 14:14:51"}}
{"Q": "Do you have a recommended wall mount for the Vibe S1 55 Inch Interactive Whiteboard?", "A": "Yes, most TV wall mounts would work as long as it supports VESA 200X200 and can support at least 65 pounds. The supported screw model is M6, with a length between 12-20mm depending on the mount.", "metadata": {"created_at": "2023-05-16 14:14:51"}}
{"Q": "Does the power cord that comes with the Vibe board work well with a wall mount?", "A": "The standard power cord may not be ideal for a wall mount as it sticks straight out of the back. Vibe does not offer a right angle plug, but it's recommended to find a compatible right angle adapter.", "metadata": {"created_at": "2023-05-16 14:14:51"}}
{"Q": "How much does the Vibe S1 55\" Interactive Whiteboard cost?", "A": "The Vibe S1 55\" Interactive Whiteboard is priced at $3,299 USD.", "metadata": {"created_at": "2023-05-16 15:33:22"}}
{"Q": "What is included in the box with the Vibe S1 55\" Interactive Whiteboard?", "A": "Included in the box are the Vibe Board S1 55\", a stylus, a power cord, and a quick start guide.", "metadata": {"created_at": "2023-05-16 15:33:22"}}
{"Q": "How much does the Vibe S1 75\" Interactive Whiteboard cost?", "A": "The Vibe S1 75\" Interactive Whiteboard is available at a cost of $6,999 USD.", "metadata": {"created_at": "2023-05-16 15:33:22"}}
{"Q": "What is included in the box with the Vibe S1 75\" Interactive Whiteboard?", "A": "Included in the box are the Vibe 75\" board, 2 styluses, a wall mount, a remote controller, an HDMI cord, a USB cable, a power cord, and a quick start guide.", "metadata": {"created_at": "2023-05-16 15:33:22"}}
{"Q": "Is there an additional cost for a stand for the Vibe S1 Interactive Whiteboard?", "A": "Yes, the stand is an additional cost of $899 USD.", "metadata": {"created_at": "2023-05-16 15:33:22"}}
{"Q": "Does Vibe offer discounts for purchasing multiple boards?", "A": "Yes, there may be discounts offered for purchasing multiple boards.", "metadata": {"created_at": "2023-05-16 15:33:22"}}
{"Q": "Is there a comparison available between Vibe boards and Promethean boards?", "A": "Yes, there is a comparison available at https://vibe.us/lp/compare-promethean/.", "metadata": {"created_at": "2023-05-16 15:33:22"}}
{"Q": "Does Vibe have resources for using their interactive whiteboards for teaching?", "A": "Yes, Vibe offers a variety of educational resources, including demos, product tours, case studies, and blogs.", "metadata": {"created_at": "2023-05-16 15:33:22"}}
{"Q": "Is the 75\" Vibe board sales tax exempt for schools?", "A": "The chat did not specify whether the 75\" Vibe board is sales tax exempt for schools. Further clarification from the company would be needed.", "metadata": {"created_at": "2023-05-16 15:33:22"}}
{"Q": "Which cameras are compatible with the Vibe Pro 75?", "A": "Most cameras that support standard Universal Video Class (UVC) should work with the device. Tested and confirmed cameras include the eMeet C980 Pro Webcam, Logitech BRIO, Logitech Conference Cam Bcc950, Logitech Meetup, Meeting Owl Pro, and Poly Studio P15.", "metadata": {"created_at": "2023-05-16 18:42:57"}}
{"Q": "Is there a way to factory reset the Vibe S1 55\" interactive whiteboard?", "A": "Yes, you can factory reset the board by following the steps provided in the Vibe Help Center article \"How to Factory Reset/Restore the Vibe board.\" However, you will need to connect a USB mouse to navigate.", "metadata": {"created_at": "2023-05-16 20:00:12"}}
{"Q": "What type of ports are available on the Vibe S1 55\" interactive whiteboard for connecting devices?", "A": "The Vibe S1 55\" interactive whiteboard has Type-C ports.", "metadata": {"created_at": "2023-05-16 20:00:12"}}
{"Q": "What should I do if I encounter issues with my Vibe interactive whiteboard?", "A": "If you encounter issues with your Vibe interactive whiteboard, you should submit a support ticket to support@vibe.us or through the Vibe Knowledge Base. Please include the model and serial numbers as well as a picture or short video of the issue.", "metadata": {"created_at": "2023-05-16 20:00:12"}}
{"Q": "Can I request a copy of the conversation with Vibe's support?", "A": "Yes, you can request a copy of the chat to be emailed to you after the conversation is concluded.", "metadata": {"created_at": "2023-05-16 20:00:12"}}
{"Q": "Can a video call be organized for support with the Vibe products?", "A": "Yes, if necessary, you can request a support call via Zoom. The availability for a Zoom call depends on the support manager's schedule.", "metadata": {"created_at": "2023-05-16 20:00:12"}}
{"Q": "Does the Vibe stand come included with the board?", "A": "No, the Vibe stand has to be purchased separately and does not come included with the board.", "metadata": {"created_at": "2023-05-16 20:24:56"}}
{"Q": "Where can I find the Vibe stand to purchase?", "A": "You can select the stand from our accessories list on the 'Shop Vibe Interactive Smart Whiteboards' page on the Vibe website.", "metadata": {"created_at": "2023-05-16 20:24:56"}}
{"Q": "How can I create a template for the Vibe interactive whiteboard?", "A": "You can use a JPG image and insert that onto the whiteboard to use as a template.", "metadata": {"created_at": "2023-05-17 14:06:08"}}
{"Q": "How can I prevent a photo used as a template on the Vibe interactive whiteboard from moving when writing notes on it?", "A": "Normally, you can lock the photo in place; however, if that doesn't work, you can contact support for assistance.", "metadata": {"created_at": "2023-05-17 14:06:08"}}
{"Q": "Can I request a call from Vibe support instead of waiting for an email response?", "A": "Yes, you can request a call from the support team by providing your contact number.", "metadata": {"created_at": "2023-05-17 14:06:08"}}
{"Q": "How can I purchase replacement styluses for my Vibe Board?", "A": "You can purchase replacement styluses from the accessories list on our webpage \"Shop Vibe Interactive Smart Whiteboards | Vibe\". Scroll midway down the page to see the accessories and click the toggle on the right to find the stylus options. The stylus pack for $15 USD is compatible with the original 55\" Vibe board.", "metadata": {"created_at": "2023-05-17 20:30:12"}}
{"Q": "Can the Vibe board run a Windows OS natively?", "A": "Currently, Vibe boards do not run Windows OS natively, but the team is working on this for later in 2023.", "metadata": {"created_at": "2023-05-18 13:50:37"}}
{"Q": "Do Vibe products come with free curbside delivery?", "A": "Yes, all orders come with free curbside delivery unless specified otherwise.", "metadata": {"created_at": "2023-05-18 14:25:57"}}
{"Q": "Are there fees associated with specific delivery needs like inside delivery or lift gate services?", "A": "Yes, there are additional fees for specific delivery needs such as inside delivery or lift gate services.", "metadata": {"created_at": "2023-05-18 14:25:57"}}
{"Q": "Can delivery preferences be changed after the order has been processed or shipping has started?", "A": "No, once the order is processed or shipping has started, delivery preferences cannot be changed.", "metadata": {"created_at": "2023-05-18 14:25:57"}}
{"Q": "Is the cost for specific delivery services valid indefinitely once a quote is given?", "A": "No, the cost for specific delivery services is only valid for 72 hours and will need to be updated after this time passes.", "metadata": {"created_at": "2023-05-18 14:25:57"}}
{"Q": "Can the Vibe board be flipped to portrait mode?", "A": "The Vibe board cannot flip vertically; it is designed to be used in landscape mode.", "metadata": {"created_at": "2023-05-18 17:22:03"}}
{"Q": "What applications come on the 75 inch Vibe Interactive Whiteboard?", "A": "The 75 inch Vibe Interactive Whiteboard comes with Vibe Canvas, Chromium browser, a few other preinstalled apps, and supports many third-party apps through the Google Play Store and Chrome Web Store.", "metadata": {"created_at": "2023-05-18 17:54:06"}}
{"Q": "Can I connect a laptop to the Vibe Interactive Whiteboard?", "A": "Yes, you can connect your laptop to the Vibe Interactive Whiteboard via wireless screencasting or HDMI.", "metadata": {"created_at": "2023-05-18 17:54:06"}}
{"Q": "What's included in the $6999 price for the 75\" Interactive Digital Whiteboard?", "A": "The $6999 price for the Vibe 75\" Interactive Digital Whiteboard includes the whiteboard, two styluses, a wall mount, a remote controller, an HDMI cord & USB cable, a power cord, and a quick start guide. A stand for the whiteboard is available at an additional cost of $899 USD, though currently there is a $100 discount on the stand.", "metadata": {"created_at": "2023-05-18 17:54:06"}}
{"Q": "Is the Vibe C1 AI Camera compatible with the Vibe S1 75 Inch Interactive Whiteboard?", "A": "No, the Vibe C1 AI Camera is for the Vibe S1 55\". For the Vibe S1 75\", standard Universal Video Class (UVC) compatible cameras should work with the device.", "metadata": {"created_at": "2023-05-18 18:17:20"}}
{"Q": "Could you recommend any compatible cameras for the Vibe S1 75 Inch Interactive Whiteboard?", "A": "Yes, compatible cameras include the eMeet C980 Pro Webcam, Logitech BRIO, Logitech Conference Cam Bcc950, Logitech Meetup, Meeting Owl Pro, and Poly Studio P15.", "metadata": {"created_at": "2023-05-18 18:17:20"}}
{"Q": "Does the Vibe S1 75 Inch Interactive Whiteboard come with a wall mount?", "A": "Yes, the 75\" board comes with a complimentary wall mount included with your purchase.", "metadata": {"created_at": "2023-05-18 18:17:20"}}
{"Q": "How can I tell if my Vibe board is the original or the S1 55\" model?", "A": "You can check the model number on the sticker at the back of the board.", "metadata": {"created_at": "2023-05-19 16:48:27"}}
{"Q": "Does the active stylus work with the original Vibe 55\" board?", "A": "No, the active stylus only works with the S1 55\" Vibe board.", "metadata": {"created_at": "2023-05-19 16:48:27"}}
{"Q": "Can I purchase additional styluses for my Vibe board?", "A": "Yes, you can buy a pack of passive styluses for $15 USD.", "metadata": {"created_at": "2023-05-19 16:48:27"}}
{"Q": "What operating system does the Vibe board run on?", "A": "The Vibe boards run on VibeOS which is based on Chromium OS.", "metadata": {"created_at": "2023-05-19 16:53:34"}}
{"Q": "Can the Vibe board connect directly to a router or switch using Ethernet?", "A": "The Vibe Board is Wi-Fi enabled and can also be connected using Ethernet.", "metadata": {"created_at": "2023-05-19 16:53:34"}}
{"Q": "How many touchpoints does the Vibe S1 55\" board support?", "A": "The Vibe S1 55\" board supports 10 simultaneous touchpoints and accommodates up to 4 persons at the board at the same time.", "metadata": {"created_at": "2023-05-19 16:53:34"}}
{"Q": "Can team members use iPad Pros with Apple Pencils to collaborate and draw on the Vibe Canvas app?", "A": "Yes, team members can use their iPad Pros with Apple Pencils to collaborate and draw using the Vibe Canvas app.", "metadata": {"created_at": "2023-05-19 16:53:34"}}
{"Q": "Can I use the Vibe board as a TV, for example to plug in an Apple TV and view content?", "A": "Yes, you can use Vibe boards for TV services and connect a TV box via HDMI.", "metadata": {"created_at": "2023-05-19 17:22:22"}}
{"Q": "What TV services can Vibe boards access?", "A": "Vibe boards allow for TV services such as Netflix, Disney+, Hulu, Amazon Prime Video, YouTube, AT&T TV, Sling TV, etc.", "metadata": {"created_at": "2023-05-19 17:22:22"}}
{"Q": "Does the Vibe Pro board have additional features or is it just bigger?", "A": "The main difference between the Vibe S1 55\" and the 75\" Pro is the size and price; they have similar capabilities.", "metadata": {"created_at": "2023-05-19 17:22:22"}}
{"Q": "Can you attach a camera to the Vibe S1 55\"?", "A": "Yes, an attachable camera (SmartCam) can be purchased with the Vibe S1 55\" as part of a bundle.", "metadata": {"created_at": "2023-05-19 17:22:22"}}
{"Q": "What cameras are compatible with the Vibe 75-inch Pro?", "A": "Most cameras that support standard Universal Video Class (UVC) should work with it. Tested cameras include eMeet C980 Pro Webcam, Logitech BRIO, amongst others.", "metadata": {"created_at": "2023-05-19 17:22:22"}}
{"Q": "How quickly do Vibe boards ship?", "A": "Orders are typically processed in 1-2 days, and shipping within the US takes about 5-7 business days, depending on the location.", "metadata": {"created_at": "2023-05-19 17:22:22"}}
{"Q": "Can the Vibe S1 55 Inch Interactive Whiteboard, stand, and webcam be delivered by the end of next week?", "A": "Standard shipping typically takes 5-10 business days, so it might require expedited shipping to ensure delivery by the specified time. The salesperson will follow up via email with further details after discussing with the Logistics team.", "metadata": {"created_at": "2023-05-19 17:33:51"}}
{"Q": "Can a WACOM board be connected to a Vibe interactive whiteboard?", "A": "Although it hasn't been tested, since the WACOM board connects via USB, it should work with Vibe interactive whiteboards.", "metadata": {"created_at": "2023-05-19 20:28:43"}}
{"Q": "How are the whiteboard capabilities of Vibe boards?", "A": "Vibe boards are very versatile and come with many features. There are product tours and demonstration videos available to help understand their capabilities.", "metadata": {"created_at": "2023-05-19 20:44:06"}}
{"Q": "Is the 75” model considered a “smart board” as well?", "A": "Yes, both the 55\" and 75\" boards are smart whiteboards.", "metadata": {"created_at": "2023-05-19 20:44:06"}}
{"Q": "How difficult is the setup and configuration for Vibe boards?", "A": "The Vibe board is plug-and-play with easy setup prompts. Installation varies depending on whether it is used on a stand or mounted on a wall.", "metadata": {"created_at": "2023-05-19 20:44:06"}}
{"Q": "Do I need to buy a separate computer to run the board?", "A": "No, the boards have their own built-in processors and do not require a separate computer.", "metadata": {"created_at": "2023-05-19 20:44:06"}}
{"Q": "Can I connect a computer wirelessly or via HDMI to the Vibe board for screencasting?", "A": "Yes, you can connect a computer wirelessly or use HDMI for screencasting.", "metadata": {"created_at": "2023-05-19 20:44:06"}}
{"Q": "When I want to schedule a meeting, do I invite the board via a unique email?", "A": "That is one of the options for scheduling a meeting with the Vibe board.", "metadata": {"created_at": "2023-05-19 20:44:06"}}
{"Q": "Do I have to use Chrome Browser to screencast with Vibe?", "A": "No, you can use the Vibe Cast app for screencasting.", "metadata": {"created_at": "2023-05-19 20:44:06"}}
{"Q": "Can the Vibe boards be used as a primary computer and replace a home PC for home education?", "A": "Yes, Vibe boards can function similarly to a computer or a giant tablet with whiteboarding features, Wi-Fi-enabled and don't require a computer to power the device.", "metadata": {"created_at": "2023-05-19 21:00:48"}}
{"Q": "Can a keyboard be connected to the Vibe boards for typing essays and writing reports?", "A": "You can connect a wireless keyboard and mouse to the board, and it also has an onscreen keyboard.", "metadata": {"created_at": "2023-05-19 21:00:48"}}
{"Q": "Does the Vibe S1 75 Inch Interactive Whiteboard have a built-in camera?", "A": "No, the Vibe S1 75 Inch Interactive Whiteboard does not have a built-in camera, but it is compatible with most cameras that support standard Universal Video Class (UVC).", "metadata": {"created_at": "2023-05-19 21:00:48"}}
{"Q": "Is there a camera available for purchase that works with the Vibe S1 55 Inch Interactive Whiteboard?", "A": "Yes, the Vibe SmartCam C1 works with the Vibe S1 55\" Board and can be purchased as a bundle with the board.", "metadata": {"created_at": "2023-05-19 21:00:48"}}
{"Q": "What UC hardware do you recommend for the Vibe S1 75 Inch Interactive Whiteboard?", "A": "Recommended cameras, speakers, and microphones for the Vibe S1 75 Inch Interactive Whiteboard can be found in the following article: https://vibe.how/en/articles/7063001-which-cameras-and-microphones-work-with-the-vibe-board-pro-75.", "metadata": {"created_at": "2023-05-22 14:10:26"}}
{"Q": "Is Vibe Microsoft Certified?", "A": "Vibe is not Microsoft certified per se, but if you have a Microsoft subscription, you can use the apps on Vibe boards.", "metadata": {"created_at": "2023-05-22 15:54:52"}}
{"Q": "Can Vibe boards be controlled and managed through the Microsoft Teams Admin Center?", "A": "Vibe boards may not be directly managed through the Microsoft Teams Admin Center, but Vibe has its own Admin portal that provides administrative control features.", "metadata": {"created_at": "2023-05-22 15:54:52"}}
{"Q": "Is the Vibe Admin portal a separate license?", "A": "No, the Vibe Admin portal is included for free with the Vibe boards.", "metadata": {"created_at": "2023-05-22 15:54:52"}}
{"Q": "Does Vibe offer a trial period for its products?", "A": "Vibe does not offer a trial period, but there is a 30-day return policy where customers can return the device within 30 days of delivery and only need to cover the cost of shipping back to the warehouse.", "metadata": {"created_at": "2023-05-22 15:54:52"}}
{"Q": "What are the recommended camera options for the Vibe S1 75 Inch Interactive Whiteboard?", "A": "The recommended camera options for the Vibe S1 75 Inch Interactive Whiteboard can be found in the article on this page: https://vibe.how/en/articles/7063001-which-cameras-and-microphones-work-with-the-vibe-board-pro-75.", "metadata": {"created_at": "2023-05-22 16:26:05"}}
{"Q": "Can other USB-connected cameras be used with the Vibe S1 75 Inch Interactive Whiteboard?", "A": "Yes, other USB-connected cameras will work as long as they support the standard Universal Video Class (UVC).", "metadata": {"created_at": "2023-05-22 16:26:05"}}
{"Q": "Can you plug a second USB camera into the Vibe interactive whiteboard?", "A": "Yes, you can connect a USB camera to the USB port on the Vibe interactive whiteboard.", "metadata": {"created_at": "2023-05-22 18:40:40"}}
{"Q": "Is it possible to use Zoom with a second extended USB camera on the Vibe board?", "A": "The Vibe board does not support connecting an external camera via an extended USB cable for use with video conferencing apps like Zoom directly. The camera has to be connected directly to the board or you can join the call from your computer as a participant from the Vibe board and share your screen/content.", "metadata": {"created_at": "2023-05-22 18:40:40"}}
{"Q": "Can you use a long USB cable with an external webcam connected to the Vibe board?", "A": "The video quality might be impacted over long distances when using a long USB cable with an external webcam, and it has not been confirmed if this setup has been tested by the Vibe team.", "metadata": {"created_at": "2023-05-22 18:40:40"}}
{"Q": "How can I track my Vibe camera shipment if the tracking number doesn't work?", "A": "The Vibe camera is shipped separately and has its own tracking number. You will be provided with the updated tracking number and expected delivery date by customer service.", "metadata": {"created_at": "2023-05-22 19:24:18"}}
{"Q": "Who do I contact if I have an issue with my Vibe camera?", "A": "For issues with your Vibe camera, you can reach out to the support team via email at support@vibe.us or submit a support ticket through the Vibe Knowledge Base.", "metadata": {"created_at": "2023-05-22 19:24:18"}}
{"Q": "What should I do if the attachment for the S1 Camera won't fit?", "A": "If you encounter an issue with the camera attachment, please contact the support team with pictures or a short video of the issue so they can assist you accordingly.", "metadata": {"created_at": "2023-05-22 19:24:18"}}
{"Q": "How can I get in touch with the Vibe support team?", "A": "You can contact the Vibe support team by sending an email to support@vibe.us or by submitting a support ticket through the Vibe Knowledge Base.", "metadata": {"created_at": "2023-05-22 19:24:18"}}
{"Q": "Does the 75\" model have a camera/mic accessory for online collaboration?", "A": "The Vibe Pro 75\" does not come with a built-in camera, but it is compatible with most standard Universal Video Class (UVC) cameras.", "metadata": {"created_at": "2023-05-22 22:19:29"}}
{"Q": "Can the Vibe Pro 75\" model integrate with apps like Zoom and Teams?", "A": "Yes, third-party UVC compatible cameras work with the Vibe Pro 75\" and can integrate with apps like Zoom and Teams just as they do with the 55\" model.", "metadata": {"created_at": "2023-05-22 22:19:29"}}
{"Q": "Can cameras be used with the 55\" Vibe board as well?", "A": "Yes, third-party cameras compatible with the Universal Video Class standard can also work with the Vibe 55\" board.", "metadata": {"created_at": "2023-05-22 22:19:29"}}
{"Q": "Do most customers purchase a camera with the Vibe board?", "A": "Many customers who need a camera choose to purchase the Vibe SmartCam as a bundle with the board.", "metadata": {"created_at": "2023-05-22 22:19:29"}}
{"Q": "What should I do if my Vibe board has a shadow issue?", "A": "If your Vibe board has a shadow issue, a support ticket will be created on your behalf, and the support team will get back to you via email to assist with the issue.", "metadata": {"created_at": "2023-05-23 13:39:22"}}
{"Q": "Is there a warranty on the Vibe boards?", "A": "Vibe boards come with a standard one year manufacturer warranty.", "metadata": {"created_at": "2023-05-23 13:39:22"}}
{"Q": "What information is needed to check if a Vibe board is still within warranty?", "A": "The order number is needed to check if the Vibe board is still within warranty.", "metadata": {"created_at": "2023-05-23 13:39:22"}}
{"Q": "Can the original Vibe 55-inch board be upgraded to use a camera?", "A": "There is no guarantee that connecting a camera directly to the board will work, it's more suitable to be used as an accessory and the camera should be connected to and host the call from a computer.", "metadata": {"created_at": "2023-05-23 14:54:38"}}
{"Q": "Is there a remote control for the Vibe 55-inch board?", "A": "There isn't a dedicated remote control for the Vibe 55-inch board, but a third-party remote control can be used, or the Eshare app can work as a remote control if you have an iPhone.", "metadata": {"created_at": "2023-05-23 14:54:38"}}
{"Q": "Does Vibe offer a trade-in program for their boards?", "A": "Vibe does not have a trade-in program at the moment.", "metadata": {"created_at": "2023-05-23 14:54:38"}}
{"Q": "How do I change the time in the lower left corner of my Vibe board?", "A": "To change the time on the Vibe board, go into Settings and look for Date and Time to set the correct time zone.", "metadata": {"created_at": "2023-05-23 14:54:38"}}
{"Q": "Why does my Vibe board go into power save mode when trying to set it up?", "A": "Make sure the OPS module is connected to the board. You can follow the steps provided in the link to insert the OPS module to ensure proper setup.", "metadata": {"created_at": "2023-05-23 16:20:08"}}
{"Q": "Is there a way to quickly log in to all apps on Vibe without entering credentials each time when multiple people are using the board?", "A": "Yes, you can use the Vibe One mobile control app to easily log in and authenticate yourself, avoiding the need to manually log in to each app every time the board is used by different people.", "metadata": {"created_at": "2023-05-23 17:37:09"}}
{"Q": "Do you still support the original 55\" Vibe Interactive Whiteboard?", "A": "Yes, we still support the original 55\" Vibe Interactive Whiteboard.", "metadata": {"created_at": "2023-05-23 18:09:07"}}
{"Q": "Who can be contacted at Vibe for security questions regarding their devices?", "A": "Vibe's Technical Support Manager, Rhett, can be reached at rhett@vibe.us for security-related inquiries.", "metadata": {"created_at": "2023-05-23 19:24:58"}}
{"Q": "Is there a contact number for Vibe's Technical Support Manager?", "A": "Yes, you can email Rhett at rhett@vibe.us to obtain an appropriate contact number.", "metadata": {"created_at": "2023-05-23 19:24:58"}}
{"Q": "Is there an external microphone available for Vibe boards?", "A": "While Vibe boards do not have built-in microphones, you can connect a USB microphone such as Emeet M2, Emeet M220, or use a camera with microphone capabilities like the Vibe SmartCam.", "metadata": {"created_at": "2023-05-23 20:26:05"}}
{"Q": "What sizes are available for the Vibe interactive whiteboards?", "A": "We currently have two Vibe boards available: 55\" and 75\".", "metadata": {"created_at": "2023-05-23 20:38:23"}}
{"Q": "What kind of mounts can be used with the Vibe S1 Board 55\"?", "A": "For our S1 Board 55\", most TV wall mounts would work as long as it supports VESA 200X200 and can support at least 65 pounds.", "metadata": {"created_at": "2023-05-23 20:38:23"}}
{"Q": "What type of screws are needed for mounting the Vibe S1 Board 55\"?", "A": "The supported screw model is M6, and the length depends on the mount but should be between 12-20mm.", "metadata": {"created_at": "2023-05-23 20:38:23"}}
{"Q": "Does the Vibe stand come with the hardware kit needed for attaching the board?", "A": "Yes, our Vibe stand comes included with the hardware kit to attach the board.", "metadata": {"created_at": "2023-05-23 20:38:23"}}
{"Q": "Is there a wall mount included with the purchase of the 75\" Vibe Pro Board?", "A": "Yes, our 75\" Vibe Pro Board comes with a complimentary wall mount included when purchased.", "metadata": {"created_at": "2023-05-23 20:38:23"}}
{"Q": "Where does my canvas save if I am a guest?", "A": "As a guest, the Canvas is not saved and using the end session feature will clear the canvas.", "metadata": {"created_at": "2023-05-23 20:50:21"}}
{"Q": "Is there a backup for the guest mode in Vibe Canvas?", "A": "Unfortunately, there isn't a backup for guest mode in Vibe Canvas.", "metadata": {"created_at": "2023-05-23 20:50:21"}}
{"Q": "How can I save a guest canvas without losing it?", "A": "To save a canvas without losing it, you need to sign into your Vibe account before creating the canvas.", "metadata": {"created_at": "2023-05-23 20:50:21"}}
{"Q": "Can the Vibe S1 interactive whiteboard be used for presentations that can be manually scrolled through and presentations that would automatically run?", "A": "Yes, the Vibe S1 interactive whiteboard supports presentations, including those that can be manually scrolled through and presentations that run automatically.", "metadata": {"created_at": "2023-05-24 14:41:33"}}
{"Q": "Does Vibe support PowerPoint presentations?", "A": "Yes, PowerPoint is supported and integrates well on Vibe boards.", "metadata": {"created_at": "2023-05-24 14:41:33"}}
{"Q": "Can Vibe Boards be wall mounted?", "A": "Yes, all Vibe Boards can be wall mounted. The 75\" Vibe Pro Board comes with a complimentary wall mount included, and the 55\" S1 Vibe Board can use most TV wall mounts that support VESA 200X200 and can hold at least 65 pounds.", "metadata": {"created_at": "2023-05-24 14:41:33"}}
{"Q": "Does Vibe offer non-profit pricing?", "A": "Vibe does not have special non-profit pricing, but the company can remove taxes with a valid sales tax exemption certificate.", "metadata": {"created_at": "2023-05-24 14:41:33"}}
{"Q": "How can I receive a quote from Vibe?", "A": "To provide a quote, Vibe needs the billing/shipping address, contact name, contact number, and the company name.", "metadata": {"created_at": "2023-05-24 14:41:33"}}
{"Q": "Does Vibe have any discounts for new customers?", "A": "Vibe offers a WELCOME100 discount as a thank you to new customers.", "metadata": {"created_at": "2023-05-24 14:41:33"}}
